zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
/* Linker emulation code for pic32m.

  This file is part of the GNU Binutils.

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston,
  MA 02110-1301, USA. */

#ifndef TARGET_IS_PIC32
#define TARGET_IS_PIC32
#endif

#ifndef PIC32
#define PIC32
#endif

#include "sysdep.h"
#include "bfd.h"
#include "bfdlink.h"
#include "getopt.h"
#include "genlink.h"

#include "ld.h"
#include "ldmain.h"
#include "ldmisc.h"
#include "ldexp.h"
#include "ldlang.h"
#include "ldfile.h"
#include "ldctor.h"
#include "ldemul.h"

#include "libbfd.h"
#include "elf-bfd.h"

#include "elf/mips.h"
#include "elfxx-mips.h"
#include "elf/pic32.h"
#include "ctype.h"
#include "pic32m-utils.h"
#include <stdint.h>
#include <limits.h>

#include "pic32-stack-usage.h"
#include "pic32-vecset.h"
#include "pic32m-options.h"
#include "pic32m-allocate.h"
#include "pic32-su-callstack.h"
#include "pic32-su-common.h"

#include "pic32m-emul.h"
#include "pic32m-emultempl.h"
#include "smartio.h"
#include "mchp/pic32-common-emul.h"
#include "pic32-debug.h"

#define DEBUG_SCOPE "bfa"

/* Defined elsewhere without a header. */
extern int pic32_is_fltpt_machine (const bfd_arch_info_type *);
extern struct pic32_memory *program_memory_free_blocks;

/* defined in bfd/pic32-attributes.c */
char *pic32_section_size_string (asection *);
char *pic32_section_attr_string (asection *);
unsigned int pic32_attribute_map (asection *);
unsigned int pic32_extended_attribute_map (asection *);
void pic32_set_attributes (asection *, unsigned int, unsigned char);
void pic32_set_extended_attributes (asection *, unsigned int, unsigned char);

#define is_mips_elf(bfd)				\
  (bfd_get_flavour (bfd) == bfd_target_elf_flavour	\
   && elf_tdata (bfd) != NULL				\
   && elf_object_id (bfd) == MIPS_ELF_DATA)

/* Fake input file for stubs.  */
static lang_input_statement_type *stub_file;
static bfd *stub_bfd;

bfd_boolean insn32;
int eh_reloc_type = R_MIPS_EH;

struct traverse_hash_info
{
  bfd *abfd;
  asection *sec;
};

/* Memory Reporting Info */
struct magic_section_description_tag {
 char *name;
 char *description;
};

struct magic_sections_tag
{
  const struct magic_section_description_tag *sections;
  unsigned int count;
  unsigned int index;
  unsigned int start;
};

bfd_boolean need_layout;

static void bfd_pic32_report_memory_sections
  (const char *, asection *, FILE *);

extern void bfd_pic32_report_memory_usage_by_module
   (FILE *);

void bfd_pic32_report_memory_usage
  (FILE *);

static void report_percent_used
  (bfd_vma, bfd_vma, FILE *);

void pic32_build_section_list
  (bfd *, asection *, PTR);

void pic32_build_section_list_vma
  (bfd *, asection *, PTR);

bfd_boolean pic32_is_empty_list(struct pic32_section* const lst);


/*static*/ void pic32_init_section_list
  (struct pic32_section **);

static bfd_boolean pic32_name_in_section_list
  (struct pic32_section *, const char *);

static void bfd_pic32_finish
  (void);

void pic32_find_data_code_sections(void);

void pic32_create_data_init_template(void);

void pic32_create_data_init_section_lists(void);

void pic32_create_data_init_template (void);

void pic32_create_specific_fill_sections(void);

bfd * bfd_pic32_create_data_init_bfd
  (bfd *);

static void bfd_pic32_add_bfd_to_link
  (bfd *, const char *);

static void bfd_pic32_scan_data_section
  (asection *, PTR);

static void bfd_pic32_scan_code_section
  (asection *, PTR);

static void bfd_pic32_skip_data_section
  (asection *, PTR);

static void pic32_strip_sections
 (bfd *);
 
asection * bfd_pic32_create_section
  (bfd *, const char *, int, int);

/*static lghica - co-resident*/ void pic32m_append_section_to_list
  (struct pic32_section *, lang_input_statement_type *, asection *);

/*static*/ void pic32_free_section_list
  (struct pic32_section **);

int pic32_section_list_length
  (struct pic32_section *);

void pic32_print_section_list
  (struct pic32_section *, const char *);

void pic32_remove_from_section_list
  (struct pic32_section *, struct pic32_section *);

void pic32_remove_group_from_section_list
  (struct pic32_section *);

struct pic32_memory * pic32_static_assign_memory
  (struct pic32_memory *, bfd_vma, bfd_vma);

struct pic32_memory* pic32_add_to_memory_list
  (struct pic32_memory *, bfd_vma, bfd_vma);

struct pic32_memory* pic32_add_shared_to_memory_list
  (struct pic32_memory *, bfd_vma, bfd_vma, asection* const);

void pic32_remove_from_memory_list
  (struct pic32_memory *, struct pic32_memory *);

void pic32_free_memory_list
  (struct pic32_memory **);

void pic32_init_memory_list
  (struct pic32_memory **);

bfd_boolean pic32_unique_section
  (const char *s);

static bfd_boolean bfd_pic32_process_bfd_after_open
  (bfd *, struct bfd_link_info *);

lang_memory_region_type *region_lookup
  (char *);

static bfd_size_type bfd_pic32_report_sections
  (struct pic32_section *, const lang_memory_region_type *,
           struct magic_sections_tag *, FILE *);

static bfd_size_type bfd_pic32_collect_section_size
  (struct pic32_section *, const lang_memory_region_type *);

struct bfd_link_hash_entry *bfd_mchp_is_defined_global_symbol
  (const char *const);

static bfd_boolean bfd_pic32_undefine_one_symbol_bfd
  (struct bfd_link_hash_entry *, PTR);

static void bfd_pic32_undefine_symbols_bfd
  (bfd *);

static void bfd_mchp_remove_archive_module
  (const char *const);

static const char * bfd_pic32_lookup_magic_section_description
  (const char *, struct magic_sections_tag *, const char **);

struct bfd_link_hash_entry *bfd_pic32_is_defined_global_symbol
  (const char *const);

// coherent section processing functions

