zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
int coherent_section_count = 0;

void pic32_remove_coherent_group_from_section_list
  (struct pic32_section *, unsigned int);

#ifdef TARGET_IS_PIC32MX
  /* fill option definitions */
static bfd * bfd_pic32_create_fill_bfd
  (bfd *);

void pic32_create_fill_templates
  (void);

static void pic32_create_unused_program_sections
  (struct pic32_fill_option *);

void pic32_report_crypto_sections
  (void);

void bfd_pic32_memory_summary
  (char *);

/* lghica co-resident - to be reviewed*/

#define PIC32_CORESIDENT (BSF_WEAK)

extern void bfd_pic32_clean_section_names
    (bfd *, asection *, PTR);


static void bfd_pic32_create_symbol
    (bfd *, char *, asection *, int, int);

static bfd * bfd_pic32_create_rom_usage_bfd
    (bfd *);

static bfd * bfd_pic32_create_ram_usage_bfd
    (bfd *);

static void bfd_pic32_pad_flash
    (void);

void pic32_create_shared_data_init_template(void);
void pic32_create_rom_usage_template(void);
void pic32_create_ram_usage_template(void);

int fill_section_count = 0;
int dinit_size = 0;

/* lghica - co-resident */
int pad_section_count = 0;

#endif

struct pic32_section *memory_region_list;
struct pic32_section *unassigned_sections;
struct pic32_section *alloc_section_list;
struct pic32_section *pic32_section_list;
extern void * bfd_alloc (bfd *, bfd_size_type);

/* defined in ldlang.c */
extern lang_statement_list_type statement_list;

/* defined in bfd/cpu-pic32m.c */
extern int pic32_is_serialmem_machine (const bfd_arch_info_type *);
extern int pic32_is_l1cache_machine (const bfd_arch_info_type *);

/* Dynamic Memory Info */
unsigned int stack_base, stack_limit;
unsigned int heap_base, heap_limit;
static bfd_boolean user_defined_stack = FALSE;
static bfd_boolean heap_section_defined = FALSE;
static ATTRIBUTE_UNUSED bfd_boolean stack_section_defined = FALSE;
static bfd *heap_bfd, *stack_bfd ATTRIBUTE_UNUSED;

extern bfd *init_bfd;
static bfd *stack_bfd;
extern unsigned char *init_data;
extern asection *init_template;
extern uint32_t init_data_padding;
extern struct pic32_section *data_sections;
extern struct pic32_section *code_sections;

/* lghica co-resident */
extern struct pic32_section     *shared_data_sections;
extern struct pic32_section     *shared_dinit_sections;
extern bfd_vma                  inherited_shared_dinit_address;


/* lghica co-resident */
extern bfd              *init_shared_bfd;
extern unsigned char    *init_shared_data;
extern asection         *init_shared_template;

extern bfd              *rom_usage_bfd;
extern unsigned char    *rom_usage_data;
extern asection         *rom_usage_template;

extern bfd              *ram_usage_bfd;
extern unsigned char    *ram_usage_data;
extern asection         *ram_usage_template;


/* Symbol Tables */
static asymbol **symtab;
static int symptr;

/* lghica co-resident */
struct pic32_memory *shared_data_memory_blocks;

struct pic32_memory *free_blocks, *data_memory_free_blocks;

static bfd_boolean elf_link_check_archive_element
  (char *, bfd *, struct bfd_link_info *);

/* Declare functions used by various EXTRA_EM_FILEs.  */

/* Memory Reporting Info */
static const struct magic_section_description_tag magic_pmdescriptions[] =
   {{"", ""},
   {".text", "App's exec code"},
   {".rodata", "Read-only const"},
   {".sdata2", "Small initialized, constant global and static data template"},
   {".sbss2", "Small uninitialized, constant global and static data"},
   {".eh_frame_hdr", "Stack unwind header"},
   {".eh_frame", "Stack unwind info"},
   {".data", "Data-init template"},
   {".got", "Global offset table"},
   {".sdata", "Small data-init template"},
   {".lit8", "8-byte constants"},
   {".lit4", "4-byte constants"},
   {".ramfunc", "RAM-funct template"},
   {".startup", "C startup code"},
   {".app_excpt", "General-Exception"},
   {".reset", "Reset handler"},
   {".bev_excpt", "BEV-Exception"},
   {".vector_0", "Interrupt Vector 0"},
   {".vector_1", "Interrupt Vector 1"},
   {".vector_2", "Interrupt Vector 2"},
   {".vector_3", "Interrupt Vector 3"},
   {".vector_4", "Interrupt Vector 4"},
   {".vector_5", "Interrupt Vector 5"},
   {".vector_6", "Interrupt Vector 6"},
   {".vector_7", "Interrupt Vector 7"},
   {".vector_8", "Interrupt Vector 8"},
   {".vector_9", "Interrupt Vector 9"},
   {".vector_10", "Interrupt Vector 10"},
   {".vector_11", "Interrupt Vector 11"},
   {".vector_12", "Interrupt Vector 12"},
   {".vector_13", "Interrupt Vector 13"},
   {".vector_14", "Interrupt Vector 14"},
   {".vector_15", "Interrupt Vector 15"},
   {".vector_16", "Interrupt Vector 16"},
   {".vector_17", "Interrupt Vector 17"},
   {".vector_18", "Interrupt Vector 18"},
   {".vector_19", "Interrupt Vector 19"},
   {".vector_20", "Interrupt Vector 20"},
   {".vector_21", "Interrupt Vector 21"},
   {".vector_22", "Interrupt Vector 22"},
   {".vector_23", "Interrupt Vector 23"},
   {".vector_24", "Interrupt Vector 24"},
   {".vector_25", "Interrupt Vector 25"},
   {".vector_26", "Interrupt Vector 26"},
   {".vector_27", "Interrupt Vector 27"},
   {".vector_28", "Interrupt Vector 28"},
   {".vector_29", "Interrupt Vector 29"},
   {".vector_30", "Interrupt Vector 30"},
   {".vector_31", "Interrupt Vector 31"},
   {".vector_32", "Interrupt Vector 32"},
   {".vector_33", "Interrupt Vector 33"},
   {".vector_34", "Interrupt Vector 34"},
   {".vector_35", "Interrupt Vector 35"},
   {".vector_36", "Interrupt Vector 36"},
   {".vector_37", "Interrupt Vector 37"},
   {".vector_38", "Interrupt Vector 38"},
   {".vector_39", "Interrupt Vector 39"},
   {".vector_40", "Interrupt Vector 40"},
   {".vector_41", "Interrupt Vector 41"},
   {".vector_42", "Interrupt Vector 42"},
   {".vector_43", "Interrupt Vector 43"},
   {".vector_44", "Interrupt Vector 44"},
   {".vector_45", "Interrupt Vector 45"},
   {".vector_46", "Interrupt Vector 46"},
   {".vector_47", "Interrupt Vector 47"},
   {".vector_48", "Interrupt Vector 48"},
   {".vector_49", "Interrupt Vector 49"},
   {".vector_50", "Interrupt Vector 50"},
   {".vector_51", "Interrupt Vector 51"},
   {".vector_52", "Interrupt Vector 52"},
   {".vector_53", "Interrupt Vector 53"},
   {".vector_54", "Interrupt Vector 54"},
   {".vector_55", "Interrupt Vector 55"},
   {".vector_56", "Interrupt Vector 56"},
   {".vector_57", "Interrupt Vector 57"},
   {".vector_58", "Interrupt Vector 58"},
   {".vector_59", "Interrupt Vector 59"},
   {".vector_60", "Interrupt Vector 60"},
   {".vector_61", "Interrupt Vector 61"},
   {".vector_62", "Interrupt Vector 62"},
   {".vector_63", "Interrupt Vector 63"}
   };

static const struct magic_section_description_tag magic_dmdescriptions[] =
   {{"", ""},
   {".data", "Initialized data"},
   {".got", "Global offset table"},
   {".sdata", "Small init data"},
   {".lit8", "8-byte constants"},
   {".lit4", "4-byte constants"},
   {".sbss", "Small uninit data"},
   {".bss", "Uninitialized data"},
   {".heap", "Dynamic Memory heap"},
   {".stack", "Min reserved for stack"},
   {".ramfunc", "RAM functions"},
   {".dbg_data", "Memory reserved for debugger exec"}};

struct magic_sections_tag magic_dm =
{
  magic_dmdescriptions,
  0, 0, 0
};
struct magic_sections_tag magic_pm =
{
  magic_pmdescriptions,
  0, 0, 0
};

