zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
  fprintf( fp, "\n        --------------------------------------------------------------------------\n");
  fprintf( fp,     "            Total Data Memory used  :  %#10lx  %10ld  ",
         (unsigned long)data_memory_used, (unsigned long)data_memory_used);
  report_percent_used (data_memory_used, total_data_memory, fp);
  fprintf( fp, "\n        --------------------------------------------------------------------------\n");


  /* Dynamic Data Memory */
#define NAME_MAX_LEN 23
#define NAME_FIELD_LEN "24"
  fprintf( fp, "\n\n%s\n", "Dynamic Data-Memory Reservation");
  fprintf( fp, "section                    address  length [bytes]      (dec)  Description\n");
  fprintf( fp, "-------                 ----------  -------------------------  -----------\n");
  fprintf( fp, "%-" NAME_FIELD_LEN "s%#10lx     %#10lx  %10ld  %s \n", "heap",
             (unsigned long)heap_base, (unsigned long)(heap_limit-heap_base),
             (unsigned long)(heap_limit-heap_base), "Reserved for heap");
  fprintf( fp, "%-" NAME_FIELD_LEN "s%#10lx     %#10lx  %10ld  %s \n", "stack",
             (unsigned long)stack_base, (unsigned long)(stack_limit-stack_base),
             (unsigned long)(stack_limit-stack_base), "Reserved for stack");
  fprintf( fp, "\n        --------------------------------------------------------------------------\n");
  

  /* 
     Report user-defined memory sections...
     They require some extra effort to organize by
     external memory region 
   */
   
  if (has_user_defined_memory) {
    struct pic32_section *r, *rnext;
    const char *region_name;
    
    /* Loop through any user-defined regions */
    for (r = memory_region_list; r != NULL; r = rnext) {
        rnext = r->next;

      if (r->sec == 0) continue;
    
      region_name = r->sec->name + strlen(memory_region_prefix);
      fprintf( fp, "\nExternal Memory %s"
               "  [Origin = 0x%lx, Length = 0x%lx]\n\n",
                region_name, r->sec->vma, r->sec->lma);


      fprintf( fp, "section                    address  length [bytes]      (dec)  Description\n");
      fprintf( fp, "-------                 ----------  -------------------------  -----------\n");


      external_memory_used = 0;
      for (s = pic32_section_list; s != NULL; s = s->next)
        if (s->sec)
          bfd_pic32_report_memory_sections (region_name, s->sec, fp);


      /* -------------------- */
      /*  print data summary  */
      /* -------------------- */

      fprintf( fp, "\n        --------------------------------------------------------------------------\n");
      fprintf( fp,     "         Total External Memory used :  %#10lx  %10ld  ",
                                   (unsigned long)external_memory_used, (unsigned long)external_memory_used);
      if (external_memory_used > 0)
        report_percent_used (external_memory_used, r->sec->lma, fp);
      fprintf( fp, "\n        --------------------------------------------------------------------------\n");
    }
  }

  fflush (fp);
#undef NAME_MAX_LEN
#undef NAME_FIELD_LEN
} /* static void bfd_pic32_report_memory_usage (...)*/


void pic32_report_crypto_sections()
{
   FILE *crypto;
   struct pic32_section *s;
   char *c;
   crypto = fopen(crypto_file, "w");
   if (!crypto){
     fprintf(stderr,"Error: crypto output file cannot be opened.\n");
     xexit(1);
   }
     for (s = pic32_section_list; s != NULL; s = s->next)
       if (s->sec && (strstr(s->sec->name,"XC32$_crypto") ||
                      (strncmp(s->sec->name, ".dinit%", 7) == 0)))
       {
          c = strchr(s->sec->name, '%');
          if (c) *c = (char) '\0';
	  fprintf( crypto, "%s\t%#x\t%#x\n", s->sec->name,
                 (unsigned int)s->sec->vma, (unsigned int)s->sec->size);
       }
    fclose(crypto);
    free(crypto_file);
}

void bfd_pic32_memory_summary(char *arg) 
{
  FILE *memory_summary_file;
  
  bfd_size_type region_prog_memory_used;
  lang_memory_region_type *region;
  unsigned int region_index, region_count;
  struct pic32_section *s;
  struct region_report_tag {
    char *name;
    char *title;
    char *total;
  };
  struct region_report_tag pmregions_to_report[] =
    {{"kseg0_program_mem",
      "kseg0 Program-Memory Usage",
      "      Total kseg0_program_mem used"},
     {"kseg0_boot_mem",
      "kseg0 Boot-Memory Usage",
      "         Total kseg0_boot_mem used"},
     {"exception_mem",
      "Exception-Memory Usage ",
      "          Total exception_mem used"},
     {"kseg1_boot_mem",
      "kseg1 Boot-Memory Usage",
      "         Total kseg1_boot_mem used"}};

  struct region_report_tag dmregions_to_report[] =
    {{"kseg0_data_mem",
      "kseg0 Data-Memory Usage",
      "         Total kseg0_data_mem used"},
      {"kseg1_data_mem",
      "kseg1 Data-Memory Usage",
      "         Total kseg1_data_mem used"}
    };


  memory_summary_file = fopen (arg, "w");
   
  if (memory_summary_file == NULL){
     fprintf(stderr,"Warning: Could not open %s.\n", arg );
     return;
   }
  else {
     /*Calculate and output memory summary file*/

     /* clear the counters */
     actual_prog_memory_used = 0;
     data_memory_used = 0;
     region_prog_memory_used = 0;
     region_data_memory_used = 0;
     total_data_memory = total_prog_memory = 0;
  
     /* build an ordered list of output sections */
     pic32_init_section_list(&pic32_section_list);
     bfd_map_over_sections(link_info.output_bfd, &pic32_build_section_list, NULL);

     region_count = sizeof(pmregions_to_report)/sizeof(pmregions_to_report[0]);
     magic_pm.count = sizeof(magic_pmdescriptions)/sizeof(magic_pmdescriptions[0]);
     magic_pm.start = magic_pm.index = 0;
     for (region_index = 0; region_index < region_count; region_index++)
     {  
        if (!lang_memory_region_exist(pmregions_to_report[region_index].name))
          continue;

        region = region_lookup(pmregions_to_report[region_index].name);

        /* collect code sections */
        for (s = pic32_section_list; s != NULL; s = s->next)
          if (s->sec && !strstr(s->sec->name, "fill$"))
          {
            region_prog_memory_used += bfd_pic32_report_sections(s, region, NULL, NULL);
          }
 
        total_prog_memory += region->length;
        actual_prog_memory_used += region_prog_memory_used;
        region_prog_memory_used = 0;
     }
 
 
     /* DATA MEMORY */
 
     region_count = sizeof(dmregions_to_report)/sizeof(dmregions_to_report[0]);
     magic_dm.count = sizeof(magic_dmdescriptions)/sizeof(magic_dmdescriptions[0]);
     magic_dm.start = magic_dm.index = 0;
     for (region_index = 0; region_index < region_count; region_index++)
     {
        if (!lang_memory_region_exist(dmregions_to_report[region_index].name))
          continue;
          
        region = region_lookup(dmregions_to_report[region_index].name);
 
        /* collect data sections */
        for (s = pic32_section_list; s != NULL; s = s->next)
          if (s->sec)
          {
            region_data_memory_used += bfd_pic32_report_sections (s, region, NULL, NULL);
          }
 
