zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
        total_data_memory += region->length;
        data_memory_used += region_data_memory_used;
        region_data_memory_used = 0;
     }

     /*Do not change the output xml format as it might throw the IDE off*/

     fprintf( memory_summary_file, "<?xml version=\"1.0\" encoding=\"UTF-8\"?> \n");
     fprintf( memory_summary_file, "<project>                                  \n");
     fprintf( memory_summary_file, "  <executable name=\"%s\">                 \n",
                                                          output_filename ); 
     fprintf( memory_summary_file, "    <memory name=\"program\">                 \n");
     fprintf( memory_summary_file, "      <units>bytes</units>                 \n");
     fprintf( memory_summary_file, "      <length>%ld</length>                 \n",
                                          (unsigned long)total_prog_memory);
     fprintf( memory_summary_file, "      <used>%ld</used>                     \n",
                                    (unsigned long)actual_prog_memory_used);
     fprintf( memory_summary_file, "      <free>%ld</free>                     \n",
              (unsigned long)(total_prog_memory - actual_prog_memory_used));
     fprintf( memory_summary_file, "    </memory>                              \n");
     fprintf( memory_summary_file, "    <memory name=\"data\">              \n");
     fprintf( memory_summary_file, "      <units>bytes</units>                 \n");
     fprintf( memory_summary_file, "      <length>%ld</length>                 \n",
                                          (unsigned long)total_data_memory);
     fprintf( memory_summary_file, "      <used>%ld</used>                     \n",
                                          (unsigned long)data_memory_used );
     fprintf( memory_summary_file, "      <free>%ld</free>                     \n",
                     (unsigned long)(total_data_memory - data_memory_used));
     fprintf( memory_summary_file, "    </memory>                              \n");
     fprintf( memory_summary_file, "  </executable>                            \n");
     fprintf( memory_summary_file, "</project>                                 \n");
  
     fclose(memory_summary_file);
  }
}

/*
** Utility routine: bfd_pic32_report_memory_sections()
**
** - show memory usage of sections in user-defined regions
*/ 
static void
bfd_pic32_report_memory_sections (region, sect, fp) 
     const char *region;
     asection *sect;
     FILE *fp;
{
  unsigned long start = sect->vma;
  unsigned int opb = bfd_octets_per_byte (link_info.output_bfd);
  bfd_size_type total = sect->rawsize / opb; /* ignore phantom bytes */

  if (PIC32_IS_MEMORY_ATTR(sect)) {
    const char *c1, *c2;
    struct pic32_section *s;
    unsigned int n;

    /* loop through the list of memory-type sections */
    for (s = user_memory_sections; s != NULL; s = s->next) {
      if (!s->file || !s->sec) continue;
      if (strcmp((char *)s->file, region) != 0) continue;
      
      c1 = (const char *) s->sec;  /* name is stored here! */
      c2 = strchr(c1, '%');        /* avoid the %n terminator */

      n = c2 ? (unsigned int) (c2 - c1) : strlen(c1);
      if (strncmp(c1, sect->name, n) == 0) {
        char *c, *name = xmalloc(strlen(sect->name) + 1);
        strcpy(name, sect->name);  /* make a local copy of the name */
        c = strchr(name, '%');
        if (c) *c = '\0';   /* remove the %n terminator */
        
        fprintf( fp, "%-24s%#10lx     %#10lx  %10ld \n", name, start, total, total);
 
        external_memory_used += total;
        free(name);
        break;
      }
    }
  }
  return;
} /* static void bfd_pic32_report_memory_sections (...)*/

/*
** Utility routine: bfd_pic32_collect_section_size()
**
** - calculate memory usage of SEC_ALLOC-flagged sections in memory
*/
static bfd_size_type
bfd_pic32_collect_section_size (s, region )
     struct pic32_section *s;
     const lang_memory_region_type *region;
{
  bfd_size_type region_used = 0;
  unsigned long start = s->sec->vma;
  unsigned long load  = s->sec->lma;
  unsigned long actual = s->sec->size;

  if (PIC32_IS_COHERENT_ATTR(s->sec)) {
    start &= 0xbfffffff;
    load &= 0xbfffffff;
  }
    
  /*
  ** report SEC_ALLOC sections in memory
  */
  if ((s->sec->flags & SEC_ALLOC)
  &&  (s->sec->size > 0))
    {
      if ((start >= region->origin) &&
          ((start + actual) <= (region->origin + region->length)))
      {
         region_used = actual;
      }
      else if ((load >= region->origin) &&
          ((load + actual) <= (region->origin + region->length)) &&
           (s->sec->flags & (SEC_HAS_CONTENTS)))
      {
         region_used = actual;
      }
    }
  return region_used;
} /* static bfd_size_type bfd_pic32_collect_section_size (...) */


static void
report_percent_used (used, max, fp)
     bfd_vma used, max;
     FILE *fp;
{
  double percent;

  if (max > 0) {
     percent = 100 * ((float) used/max);

     if (percent)
       fprintf( fp, "%.1f%% of %#lx", percent, max);
     else
       fprintf( fp, "<1%% of %#lx", max);
   }
}

/*
** Return a pointer to bfd_link_hash_entry
** if a global symbol is defined;
** else return zero.
*/
struct bfd_link_hash_entry *
bfd_mchp_is_defined_global_symbol (name)
     const char *const name;
{
    struct bfd_link_hash_entry *h;
    h = bfd_link_hash_lookup (link_info.hash, name, FALSE, FALSE, TRUE);
    if ((h != (struct bfd_link_hash_entry *) NULL) &&
        (h->type == bfd_link_hash_defined)) {
      return h;
    }
    else
      return (struct bfd_link_hash_entry *) NULL;
}


/*
** Undefine one symbol by BFD
**
** This routine is called by bfd_link_hash_traverse()
*/
static bfd_boolean
bfd_pic32_undefine_one_symbol_bfd (h, p)
     struct bfd_link_hash_entry *h;
     PTR p;
{
  struct bfd_link_hash_entry *H = (struct bfd_link_hash_entry *) h;
  struct traverse_hash_info *info = ( struct traverse_hash_info *) p;

  /* if this symbol is defined, and owned by the BFD in question */
  if ((( H->type == bfd_link_hash_defined) ||
       ( H->type == bfd_link_hash_defweak)) &&
      ( H->u.def.section->owner == info->abfd))

    /* mark it undefined */
    H->type = bfd_link_hash_undefined;

  /* traverse the entire hash table */
  return TRUE;
} /* static bfd_boolean bfd_pic32_undefine_one_symbol_bfd (...)*/


