zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
/*
** Undefine all symbols owned by a bfd
*/
static void
bfd_pic32_undefine_symbols_bfd (target)
     bfd *target;
{
    struct traverse_hash_info info;
    info.abfd = target;

    /* traverse the global linker hash table */
    bfd_link_hash_traverse (link_info.hash,
       bfd_pic32_undefine_one_symbol_bfd, &info);

} /* static void bfd_pic32_undefine_symbols_bfd (...) */

/*
** Remove an archive module
*/
static void
bfd_mchp_remove_archive_module (name)
     const char *const name;
{
  LANG_FOR_EACH_INPUT_STATEMENT (is)
  {
      if (strcmp (is->the_bfd->filename, name) == 0)
      {
	DEBUG({
	    LOG("\nRemoving %s\n", name);
	    LOG("  %s had %d symbols\n", name , is->the_bfd->symcount);
          });

          /*
          ** remove the symbols
          */
          bfd_pic32_undefine_symbols_bfd (is->the_bfd);
          is->the_bfd->symcount = 0;

          /*
          ** remove the sections in this bfd
          */
          bfd_section_list_clear(is->the_bfd);
          break;
      }
  }
} /* static void bfd_mchp_remove_archive_module */


/*****************************************************************************
**
** Section List Routines
**
** Maintain a list of sections in order
** of ascending load address.
**
** Used for creating memory usage reports.
**
*/

/*
** check if a list is empty
*/
bfd_boolean pic32_is_empty_list(struct pic32_section* const lst)
{
    if (lst == NULL)
        return TRUE;

    if (lst->next == NULL)
        return TRUE;

    return FALSE;
}

#if 0
/*
** Create a new list
**
** - first item is null
*/
/*static*/ void
pic32_init_section_list(lst)
     struct pic32_section **lst;
{
  *lst = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  if (NULL == lst) {
    fprintf( stderr, "Fatal Error: Not enough memory to initialize section list\n");
    abort();
  }
  (*lst)->next = 0;
  (*lst)->sec = 0;
  (*lst)->attributes = 0;
  (*lst)->file = 0;
  (*lst)->pic32_size = 0;
  (*lst)->children = NULL;
}

#endif

/*
** Add a section to the list
**
** - in order of increasing load address
** - this function is called via bfd_map_over_sections()
*/
void
pic32_build_section_list_vma (abfd, sect, fp)
     bfd *abfd ATTRIBUTE_UNUSED ;
     asection *sect;
     PTR fp ATTRIBUTE_UNUSED ;
{
  struct pic32_section *new, *s, *prev;
  int done = 0;

  /* Already added due to lma */
  if (sect->lma == sect->vma)
    return;

  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  if (NULL == new) {
    fprintf( stderr, "Fatal Error: Could not build section list\n");
    abort();
  }
  new->sec  = sect;
  new->attributes = pic32_attribute_map(sect);
  new->file = 0;
  new->use_vma = 1;
  new->pic32_size = sect->size;
  new->region = NULL;
  new->children = NULL;

  /* insert it at the right spot */
  prev = pic32_section_list;
  for (s = prev; s != NULL; s = s->next)
  {
      if (s->sec && (new->sec->vma < s->sec->lma))
        {
          prev->next = new;
          new->next = s;
	  PIC32_DEBUG("pic32_build_section_list_vma: Adding %s LMA:%x VMA:%x",
		      new->sec->name, (unsigned int)new->sec->lma,
		      (unsigned int)new->sec->vma);
          done++;
          break;
        }
      prev = s;
    }

  if (!done)
    {
      prev->next = new;
      new->next = NULL;
    }
} /* static void pic32_build_section_list_vma (...) */

void
pic32_build_section_list (abfd, sect, fp)
     bfd *abfd ATTRIBUTE_UNUSED ;
     asection *sect;
     PTR fp ATTRIBUTE_UNUSED ;
{
  struct pic32_section *new, *s, *prev;
  int done = 0;

  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  if (NULL == new) {
    fprintf( stderr, "Fatal Error: Could not build section list\n");
    abort();
  }
  new->sec  = sect;
  new->attributes = pic32_attribute_map(sect);
  new->file = 0;
  new->use_vma = 0;
  new->pic32_size = sect->size;
  new->region = NULL;
  new->children = NULL;

  /* insert it at the right spot */
  prev = pic32_section_list;
  for (s = prev; s != NULL; s = s->next)
    {
      if (s->sec && (new->sec->lma < s->sec->lma))
        {
          prev->next = new;
          new->next = s;
	  PIC32_DEBUG("pic32_build_section_list: Adding %s LMA:%x VMA:%x",
		      new->sec->name, (unsigned int)new->sec->lma,
		      (unsigned int)new->sec->vma);
          done++;
          break;
        }
      prev = s;
    }

  if (!done)
    {
      prev->next = new;
      new->next = NULL;
    }
} /* static void pic32_build_section_list (...) */


/*
** Search a section list by name
*/
static bfd_boolean
pic32_name_in_section_list (lst, name)
     struct pic32_section *lst;
     const char *name; 
{
  struct pic32_section *s, *next;
  for (s = lst; s != NULL; s = next) {
    next = s->next;
    if (s->sec && strcmp(s->sec->name, name) == 0)
      return TRUE;
  }
  return FALSE;
}


/*
** region_lookup()
**
** Call this instead of lang_memory_region_lookup()
** if you want reasonable defaults set for the
** following regions:
**
** data
** program
**
** Note: Ideally, every linker script will include
** these definitions. But we don't want to fail
** if the user is running with a minimal script.
*/
#define NAME_IS(s) \
  ((strlen(name) == strlen(#s)) && \
           strcmp(name, (#s)) == 0)

lang_memory_region_type *
region_lookup( name )
     char * name;
{
  lang_memory_region_type *region;
  bfd_vma upper_limit = 0;
  int use_default = 0;

  region = lang_memory_region_lookup (name, FALSE);
  if (region->length == ~(bfd_size_type) 0) {
    if (NAME_IS(kseg0_program_mem)) {
      use_default = 1;
      region->origin = 0x9D000000;     /* works with 32MX320F512L */
      region->length = 0x80000;
      upper_limit    = (region->origin + region->length)-1;
    }
    else if (NAME_IS(kseg0_boot_mem)) {
      use_default = 1;
      region->origin = 0x9FC00490;     /* works with 32MX320F512L */
      region->length = 0x970;
      upper_limit    = (region->origin + region->length)-1;
    }
    else if (NAME_IS(exception_mem)) {
      use_default = 1;
      region->origin = 0x9FC01000;     /* works with 32MX320F512L */
      region->length = 0x1000;
      upper_limit    = (region->origin + region->length)-1;
    }
    else if (NAME_IS(kseg1_boot_mem)) {
      use_default = 1;
      region->origin = 0x9FC01000;     /* works with 32MX320F512L */
      region->length = 0x490;
      upper_limit    = (region->origin + region->length)-1;
    }
    else if (NAME_IS(kseg1_data_mem)) {
      use_default = 1;
      region->origin = 0xA0000000;     /* works with 32MX320F512L */
      region->length = 0x8000;
      upper_limit    = (region->origin + region->length)-1;
    }
    else if (NAME_IS(kseg0_data_mem)) {
      use_default = 1;
      region->origin = 0x80000000;     /* works with 32MX320F512L */
      region->length = 0x8000;
      upper_limit    = (region->origin + region->length)-1;
    }
    else
      einfo("Memory region %s does not exist\n", name);

    if (use_default) {
      einfo(_("%P: Warning: %s memory region not defined,"
              " using default range: 0x%v .. 0x%v\n"),
            name, region->origin, upper_limit);
      region->current = region->origin;
    }
  }

  return region;
}

