zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
/*
** Utility routine: bfd_pic32_report_sections()
**
** - show memory usage of SEC_ALLOC-flagged sections in memory
*/
static bfd_size_type
bfd_pic32_report_sections (s, region, magic_sections, fp)
     struct pic32_section *s;
     const lang_memory_region_type *region;
     struct magic_sections_tag *magic_sections;
     FILE *fp;
{
  const char *description;
  bfd_size_type region_used = 0;
  unsigned long start = s->sec->vma;
  unsigned long load  = s->sec->lma;
  unsigned long actual = s->sec->output_section->size;
  size_t name_len = 0;

  if (PIC32_IS_COHERENT_ATTR(s->sec)) {
    start &= 0xbfffffff;
    load &= 0xbfffffff;
  }
    
  /*
  ** report SEC_ALLOC sections in memory
  */
  if ((s->sec->flags & SEC_ALLOC)
  &&  (s->sec->size > 0))
    {
      char *name, *c;
#define NAME_MAX_LEN 23
#define NAME_FIELD_LEN "24"
#define COH_ADDR    0x20000000
      if (strstr(s->sec->name, "fill$")) {
        name = xmalloc(7);
        if (PIC32_IS_ABSOLUTE_ATTR(s->sec))
          strcpy(name, "FILLED");
        else
          strcpy(name, "UNUSED");
      }
      else {
      /* make a local copy of the name */
      name_len = strlen(s->sec->name);
      name = xmalloc(name_len + 1);
      if (NULL == name) {
        fprintf( stderr, "Fatal Error: Could not copy section name\n");
        abort();
      }
      if (name_len > NAME_MAX_LEN)
        name_len = NAME_MAX_LEN;
      strncpy(name, s->sec->name, name_len);
      name[name_len] = '\0';
      }
      /* clean the name of %n */
      c = strchr(name, '%');
      if (c) *c = (char) '\0';

      if (((start|COH_ADDR) >= (region->origin|COH_ADDR)) &&
          (((start + actual)|COH_ADDR) <= ((region->origin + region->length)|COH_ADDR)))
      {
        if (fp != NULL)
        {
          bfd_pic32_lookup_magic_section_description (name, magic_sections, &description);
          fprintf( fp, "%-" NAME_FIELD_LEN "s%#10lx     %#10lx  %10ld  %s \n", name,
                 start, actual, actual, description);
        }
        region_used = actual;
      }
      else if ((load >= region->origin) &&
          ((load + actual) <= (region->origin + region->length)) &&
           (s->sec->flags & (SEC_HAS_CONTENTS)))
      {
        if (fp != NULL)
        {
          bfd_pic32_lookup_magic_section_description (name, magic_sections, &description);
          fprintf( fp, "%-" NAME_FIELD_LEN "s%#10lx     %#10lx  %10ld  %s \n", name,
                  load, actual, actual, description);
        }
        region_used = actual;
      }
      free(name);
#undef NAME_MAX_LEN
#undef NAME_FIELD_LEN
    }
  return region_used;
} /* static bfd_size_type bfd_pic32_report_sections (...) */

static const char empty_string[] = "";
static const char * bfd_pic32_lookup_magic_section_description (name, magic_sections, description)
     const char *name;
     struct magic_sections_tag *magic_sections;
     const char **description;
{
      /* Assume that we don't have a description for the magic section name */
      *description = &empty_string[0];
      do
      {
        if (strcmp(name, magic_sections->sections[magic_sections->index].name))
        {
          /* Keep searching */
          magic_sections->index++;
          if (magic_sections->index == magic_sections->count)
            magic_sections->index = 0;
        }
        else
        {
          *description = magic_sections->sections[magic_sections->index].description;
          break;
        }
      } while(magic_sections->index != magic_sections->start);
      /* Start the next search where this one left off. */
      magic_sections->start = magic_sections->index;

      return *description;
} /* static void char * bfd_pic32_lookup_magic_section_description (...) */

static bfd_boolean
bfd_pic32_process_bfd_after_open (abfd, info)
     bfd *abfd;
     struct bfd_link_info *info ATTRIBUTE_UNUSED;
{
  asection *sec;
  asymbol **symbols = 0;
  struct pic32_symbol_list *pic32_symbol_list = NULL;

  /*
  ** check the input file name
  */
  if (!strcmp(abfd->filename, "sbrk.o"))
  {
      pic32_heap_required = 1;
  }

   /*
  ** loop through the symbols in this bfd
  */
  {
	pic32_symbol_list = bfd_pic32_fill_symbol_list(abfd);

   /*
  ** loop through the sections in this bfd
  */
  for (sec = abfd->sections; sec != 0; sec = sec->next)
  {
    /* if section has extended attributes, apply them */
    if (pic32_symbol_list) {
      int c;
      for (c=0; c < pic32_symbol_list->pic32_symbol_count; c++) {
        if (strcmp(sec->name, pic32_symbol_list->syms[c].name) == 0)
          pic32_set_extended_attributes(sec, pic32_symbol_list->syms[c].value, 0);
      }
    }

    /* if section has HEAP attribute, record that fact */
    if (PIC32_IS_HEAP_ATTR(sec) && (sec->size > 0)) {
      if (heap_section_defined)
        einfo(_("%P%X: Error: Multiple heap sections defined\n"));
      else {
        heap_section_defined = TRUE;
        heap_bfd = sec->owner;
        if ((pic32_heap_size > 0) &&
            (pic32_heap_size != (sec->size)))
          einfo(_("%P%X: Error: Size of heap requested (%d bytes)"
                  " does not match heap defined in section \'%s\'"
                  "  (%d bytes)\n"), pic32_heap_size, sec->name,
                   sec->size );
      }
    }

    struct bfd_link_hash_entry *h;
    flagword old_flags = sec->flags;
    static unsigned int region_index = 0;
    const char *region_name = 0;

    /* If section represents a memory region, record it */

    if (PIC32_IS_INFO_ATTR(sec) &&
        strncmp(sec->name, memory_region_prefix, 
                strlen(memory_region_prefix)) == 0 &&
	strchr(sec->name, '@') == NULL) 
  {
      region_name = sec->name + strlen(memory_region_prefix);

      region_index++;
      h = bfd_pic32_is_defined_global_symbol(region_name);
      if (h == NULL) 
      {
	PIC32_DEBUG("  ..creating global symbol for user-defined memory %s",
		    region_name);

        _bfd_generic_link_add_one_symbol (info, abfd,
                                          region_name, BSF_GLOBAL,
                                          bfd_abs_section_ptr, region_index,
                                          region_name, 1, 0, 0);
      }
    }
    
    /* process input section flags here, if necessary */
    if ((sec->flags & (SEC_ALLOC | SEC_LOAD | SEC_DATA)) ==
         (SEC_ALLOC | SEC_LOAD | SEC_DATA))
      sec->flags |= SEC_HAS_CONTENTS;  /* elf linker needs this */

    /* report if flags were changed */
    if (sec->flags != old_flags)
      PIC32_DEBUG("   adjust flags: %s %x --> %x", sec->name, old_flags, sec->flags);

