zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
    if (PIC32_IS_INFO_ATTR(sec) &&
        strncmp(sec->name, memory_region_prefix, 
                strlen(memory_region_prefix)) == 0 &&
	strchr(sec->name, '@') != NULL) 
    {
 	char *ext_mem_sec_region_name = xstrdup(sec->name);
 	size_t ext_mem_sec_region_len = strlen(ext_mem_sec_region_name);
 	
	const char *atdelim = strchr(ext_mem_sec_region_name,'@');
	
	int atdelim_index  = 0;
 	int mem_prefix_len = 0;
 	
	atdelim_index  = (int) (atdelim - ext_mem_sec_region_name) ;
	mem_prefix_len = strlen(memory_region_prefix);
	
	int ext_sec_name_len = 0 ;
	int ext_reg_name_len = 0 ;

	ext_reg_name_len = atdelim_index - mem_prefix_len;
	ext_sec_name_len = ext_mem_sec_region_len - atdelim_index - 1 ;

	char *region_name_tmp = xmalloc(ext_reg_name_len+1);
	strncpy(region_name_tmp, ext_mem_sec_region_name+mem_prefix_len, ext_reg_name_len);
	region_name_tmp[ext_reg_name_len] = '\0';
	
	char *sec_name    = xmalloc(ext_sec_name_len+1);
	strncpy(sec_name, ext_mem_sec_region_name+atdelim_index+1, ext_sec_name_len);
	sec_name[ext_sec_name_len] = '\0';

        pic32m_append_section_to_list (user_memory_sections,
                                       (lang_input_statement_type *) region_name_tmp,
                                       (asection *) sec_name);

	free(ext_mem_sec_region_name); 
    }
  }
  if (symbols)
	free(symbols);
  if (pic32_symbol_list) {
	free(pic32_symbol_list->syms);
	free(pic32_symbol_list);
  }
  return(TRUE);
 }
}

/*
** Create a bfd for the data init template
**
** Uses the following global variables:
**   symtab
**   symptr
*/
bfd *
bfd_pic32_create_data_init_bfd (parent)
     bfd *parent ATTRIBUTE_UNUSED;
{
  bfd_size_type size;
  bfd *abfd;
  asection *sec;
  char *oname;
  int flags, align;

  /* create a bare-bones bfd */
  oname = (char *) bfd_alloc (link_info.output_bfd, 20);
  snprintf (oname, 20, "data_init");
  abfd = bfd_create (oname, parent);
  bfd_find_target (EMULTEMPL.output_format, abfd);
  bfd_make_writable (abfd);

  bfd_set_format (abfd, bfd_object);
  bfd_set_arch_mach (abfd, bfd_arch_mips, 0);

  /* create a symbol table (room for 1 entry) */
  symptr = 0;
  symtab = (asymbol **) bfd_alloc (link_info.output_bfd, 2 * sizeof (asymbol *));

  /*
  ** create a bare-bones section for .dinit
  */
  flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP |
          SEC_LINKER_CREATED | SEC_ALLOC | SEC_READONLY;
  align = 2; /* 2^2 */
  sec = bfd_pic32_create_section (abfd, ".dinit", flags, align);
  size = 0; /* will update later */
  bfd_set_section_size (abfd, sec, size);

  /* put in the symbol table */
  bfd_set_symtab (abfd, symtab, symptr);

  /* will add section contents later */

  /* finish it */
  if (!bfd_make_readable (abfd))
    {
      fprintf( stderr, "Link Error: can't make data init readable\n");
      abort();
    }

  return abfd;
} /* static bfd * bfd_pic32_create_data_init_bfd (...)*/

/* lghica - co-resident */

static bfd *
bfd_pic32_create_shared_data_init_bfd (bfd *parent ATTRIBUTE_UNUSED)
{
    bfd_size_type       size;
    bfd                 *abfd;
    asection            *sec;
    struct pic32_section *s;
    char                *oname;
    int                 flags, align;

    /* create a bare-bones bfd */
    oname = (char *) bfd_alloc (link_info.output_bfd, 20);
    sprintf (oname, "shared_data_init");
    abfd = bfd_create (oname, parent);
    bfd_find_target (EMULTEMPL.output_format, abfd);
    bfd_make_writable (abfd);

    bfd_set_format (abfd, bfd_object);
    bfd_set_arch_mach (abfd, bfd_arch_mips, 0);

    /* create a symbol table (room for 1 entry) */
    symptr = 0;
#if 0
    if (pic32_inherit_application_info)
        symtab = (asymbol **) bfd_alloc (link_info.output_bfd, 2*sizeof (asymbol *));
    else
#endif
    symtab = (asymbol **) bfd_alloc (link_info.output_bfd, sizeof (asymbol *));

    /*
    ** create a bare-bones section for .shared.dinit
    */
    flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP | SEC_READONLY;
    align = 1; /* 2^1 */
    sec = bfd_pic32_create_section (abfd, ".shared.dinit", flags, align);
    size = 0; /* will update later */
    bfd_set_section_size (abfd, sec, size);

    /* allocate .shared.dinit at the same address where previous .shared.dinit
    was allocated */
    if (pic32_inherit_application_info)
    {
        for (s = inherited_sections; s!= NULL; s = s->next)
        {
            if (s->sec && strcmp(s->sec->name, ".shared.dinit") == 0)
            {
                PIC32_SET_ABSOLUTE_ATTR(sec);
                bfd_set_section_vma(abfd, sec, s->sec->vma);
            }
        }
    }

#if 0 /* Keeping this in case it is needed */
    if (pic32_exclude_application) {
        flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP | SEC_READONLY;
        align = 1; /* 2^1 */
        sec = bfd_pic32_create_section (abfd, ".shared.dinit$", flags, align);
        size = 4;
        bfd_set_section_size (abfd, sec, size);
        for (s = inherited_sections; s!= NULL; s = s->next)
        {
            if (s->sec && strcmp(s->sec->name, ".shared.dinit") == 0)
                inherited_shared_dinit_address = sec->vma = sec->lma = s->sec->vma;
        }
        PIC32_SET_ABSOLUTE_ATTR(sec);
    }
#endif

    /* put in the symbol table */
    bfd_set_symtab (abfd, symtab, symptr);

    /* will add section contents later */

    /* finish it */
    if (!bfd_make_readable (abfd))
    {
        fprintf( stderr, "Link Error: can't make data init readable\n");
        abort();
    }
    return abfd;
}



static bfd *
bfd_pic32_create_rom_usage_bfd (parent)
    bfd *parent ATTRIBUTE_UNUSED;
{
    bfd_size_type   size;
    bfd             *abfd;
    asection        *sec;
    char            *oname;
    int             flags, align;

    LANG_FOR_EACH_INPUT_STATEMENT (f)
    {
        for (sec = f->the_bfd->sections;
                sec != (asection *) NULL;
                sec = sec->next)
            if (strcmp(sec->name,".rom_usage") == 0)
                sec->flags |= SEC_EXCLUDE;
    }

    /* create a bare-bones bfd */
    oname = (char *) bfd_alloc (link_info.output_bfd, 20);
    sprintf (oname, "rom_usage_bfd");
    abfd = bfd_create (oname, parent);
    bfd_find_target (EMULTEMPL.output_format, abfd);
    bfd_make_writable (abfd);

    bfd_set_format (abfd, bfd_object);
    bfd_set_arch_mach (abfd, bfd_arch_mips, 0);

