zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
    /* create a symbol table (room for 1 entry) */
    symptr = 0;
    symtab = (asymbol **) bfd_alloc (link_info.output_bfd, sizeof (asymbol *));

    /*
    ** create a bare-bones section for .rom_usage
    */
    flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP;
    align = 1; /* 2^1 */
    sec = bfd_pic32_create_section (abfd, ".rom_usage", flags, align);
    size = 0; /* will update later */
    bfd_set_section_size (abfd, sec, size);

    /* create global label at offset zero */
    bfd_pic32_create_symbol (abfd, "__ROM_USAGE", sec,
                        BSF_GLOBAL | BSF_WEAK, 0);

    /* put in the symbol table */
    bfd_set_symtab (abfd, symtab, symptr);

    /* will add section contents later */

    /* finish it */
    if (!bfd_make_readable (abfd))
    {
        fprintf( stderr, "Link Error: can't make rom usage readable\n");
        abort();
    }

    return abfd;
}   /* end of bfd_pic32_create_rom_usage_bfd */

static bfd *
bfd_pic32_create_ram_usage_bfd (parent)
    bfd *parent ATTRIBUTE_UNUSED;
{
    bfd_size_type   size;
    bfd             *abfd;
    asection        *sec;
    char            *oname;
    int             flags, align;

    LANG_FOR_EACH_INPUT_STATEMENT (f)
    {
        for (sec = f->the_bfd->sections;
                    sec != (asection *) NULL;
                    sec = sec->next)
            if (strcmp(sec->name,".ram_usage") == 0)
                sec->flags |= SEC_EXCLUDE;
    }

    /* create a bare-bones bfd */
    oname = (char *) bfd_alloc (link_info.output_bfd, 20);
    sprintf (oname, "ram_usage_bfd");
    abfd = bfd_create (oname, parent);
    bfd_find_target (EMULTEMPL.output_format, abfd);
    bfd_make_writable (abfd);

    bfd_set_format (abfd, bfd_object);
    bfd_set_arch_mach (abfd, bfd_arch_mips, 0);

    /* create a symbol table (room for 1 entry) */
    symptr = 0;
    symtab = (asymbol **) bfd_alloc (link_info.output_bfd, sizeof (asymbol *));

    /*
    ** create a bare-bones section for .ram_usage
    */
    flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP;
    align = 1; /* 2^1 */
    sec = bfd_pic32_create_section (abfd, ".ram_usage", flags, align);
    size = 0; /* will update later */
    bfd_set_section_size (abfd, sec, size);

    /* create global label at offset zero */
    bfd_pic32_create_symbol (abfd, "__RAM_USAGE", sec,
    BSF_GLOBAL | BSF_WEAK, 0);

    /* put in the symbol table */
    bfd_set_symtab (abfd, symtab, symptr);

    /* will add section contents later */

    /* finish it */
    if (!bfd_make_readable (abfd))
    {
        fprintf( stderr, "Link Error: can't make ram usage readable\n");
        abort();
    }

    return abfd;
}   /* end of bfd_pic32_create_ram_usage_bfd */

void
pic32_find_data_code_sections(void)
{
  /*
   * Loop through all input sections and
   * build a list of DATA or BSS type.
   */
  asection * sec;
  LANG_FOR_EACH_INPUT_STATEMENT (f)
    {
      for (sec = f->the_bfd->sections;
           sec != (asection *) NULL;
           sec = sec->next)
        if (((sec->size > 0) && (sec->linked == 0) && (PIC32_IS_DATA_ATTR(sec)))
            || (PIC32_IS_BSS_ATTR(sec)) || PIC32_IS_RAMFUNC_ATTR(sec)
            || ((sec->size > 0) && (PIC32_IS_DATA_ATTR_WITH_MEMORY_ATTR(sec)))
            || (PIC32_IS_BSS_ATTR_WITH_MEMORY_ATTR(sec)))
          {
          /* fix for xc32-146 */
          if (PIC32_IS_DATA_ATTR(sec) &&
              (strcmp(sec->name, ".rodata") == 0)) {
            sec->flags &= ~SEC_DATA;
            PIC32_SET_CODE_ATTR(sec);
            if (sec->owner->my_archive) {
              einfo(_("%P: Warning: %s of %s needs to be compiled"
                      " with MPLAB XC32.\n"),
                      sec->owner->filename, sec->owner->my_archive->filename);
            }
            else {
              einfo(_("%P: Warning: %s needs to be compiled"
                      " with MPLAB XC32.\n"), sec->owner->filename);
            }
          }
          else
          {
            if ((sec->shared == 1) && (sec->linked == 0))
              pic32m_append_section_to_list(shared_data_sections, f, sec);
            else
              pic32m_append_section_to_list(data_sections, f, sec);
          }
        }
       else if ((sec->size > 0) && PIC32_IS_CODE_ATTR(sec))
         pic32m_append_section_to_list(code_sections, f, sec);
    }
}

void
pic32_create_data_init_section_lists(void)
{
  /* init list of input data sections */
  pic32_init_section_list(&data_sections);

  /* lghica co-resident */
  pic32_init_section_list(&shared_data_sections);
  pic32_init_section_list(&shared_dinit_sections);

  /* init list of input code sections */
  pic32_init_section_list(&code_sections);
}

void
pic32_create_data_init_template(void)
{
  struct pic32_section *s;
  int total_data = 0;
  asection *sec;

  /*
  ** If data init support is enabled, create a BFD
  ** for section .dinit and add it to the link.
  */

  if (pic32_data_init)
    {
      init_bfd = bfd_pic32_create_data_init_bfd (link_info.output_bfd);
      bfd_pic32_add_bfd_to_link (init_bfd, init_bfd->filename);

      /* Compute size of data init template */
      for (s = data_sections; s != NULL; s = s->next)
        if ((s->sec) && ((s->sec->flags & SEC_EXCLUDE) == 0))
          bfd_pic32_scan_data_section(s->sec, &total_data);

      if (pic32_code_in_dinit) {
        for (s = code_sections; s != NULL; s = s->next) {
          if ((s->sec) && ((s->sec->flags & SEC_EXCLUDE) == 0))
            bfd_pic32_scan_code_section(s->sec, &total_data);
        }
      }

      total_data += 4; /* zero terminated */

      ///\ reserve space for entry_address
      if (pic32_code_in_dinit)
        total_data += 4;

      ///\ reserve space for pointer to shared.dinit
      if ((shared_data_sections != NULL) && (shared_data_sections->sec != NULL))
        total_data +=8;

      if (total_data % 16)
        init_data_padding += 16 - (total_data % 16);
      total_data += init_data_padding;

      dinit_size = total_data;

