zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
      PIC32_DEBUG("optim_dinit dinit_size %d", total_data);

      /* allocate memory for the template */
      init_data = (unsigned char *) bfd_alloc (link_info.output_bfd,
                                               total_data);
      if (!init_data)
        {
          fprintf( stderr, "Link Error: not enough memory for data template\n");
          abort();
        }

      /* fill the template with a default value */
      init_data = memset( init_data, 0x11, total_data);

      /* attach it to the input section */
      sec = bfd_get_section_by_name(init_bfd, ".dinit");
      if (sec)
        {
          sec->size = total_data;
          sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD |
                         SEC_CODE | SEC_KEEP | SEC_READONLY);
          sec->contents = init_data;
          bfd_set_section_size (init_bfd, sec, total_data);
          init_template = sec;  /* save a copy for later */

          if (pic32_dinit_has_absolute_address)
            {
              bfd_set_section_vma(init_bfd, sec, dinit_address);
              PIC32_SET_ABSOLUTE_ATTR(sec);
            }
          if (pic32_dinit_in_serial_mem)
            {
              PIC32_SET_SERIAL_MEM_ATTR(sec);
              sec->flags &= ~(SEC_CODE | SEC_READONLY);

              char *name;
              char *ext_attr_prefix = "__ext_attr_";

              name = xmalloc (strlen(sec->name) + strlen(ext_attr_prefix) + 1);
              (void) sprintf(name, "%s%s", ext_attr_prefix, sec->name);
              _bfd_generic_link_add_one_symbol (&link_info,
                                                link_info.output_bfd, name,
                                                PIC32_CORESIDENT /*BSF_GLOBAL*/,
                                                bfd_abs_section_ptr,
                                                pic32_extended_attribute_map(sec),
                                                name, 1, 0, 0);
            }
        }
      else
	PIC32_DEBUG("after_open: section .dinit not found");
    }
  else /* if (pic32_data_init) */
    {
      /* warn if initial data values will be ignored */
      for (s = data_sections; s != NULL; s = s->next)
        if (s->sec)
          bfd_pic32_skip_data_section(s->sec, &total_data);
    }
}

/*
** Create a bfd for the stack
**
** Uses the following global variables:
**   symtab
**   symptr
**   pic32_stack_size
*/
static bfd *
bfd_pic32_create_stack_bfd (bfd *parent) {
  bfd_size_type size;
  bfd *abfd;
  asection *sec;
  char *oname;
  int flags, align;

  /* create a bare-bones bfd */
  oname = (char *) xmalloc (20);
  sprintf (oname, "stack");
  abfd = bfd_create (oname, parent);
  bfd_find_target (EMULTEMPL.output_format, abfd);
  bfd_make_writable (abfd);

  bfd_set_format (abfd, bfd_object);
  bfd_set_arch_mach (abfd, bfd_arch_mips, 0);

  /* create a symbol table (room for 1 entry) */
  symptr = 0;
  symtab = (asymbol **) xmalloc (2 * sizeof (asymbol *));

  /* create a bare-bones section */
  flags = SEC_LINKER_CREATED | SEC_KEEP;
  align = 1;
  sec = bfd_pic32_create_section (abfd, ".stack", flags, align);
  bfd_set_section_flags (abfd, sec, flags);
  size = 8;
  bfd_set_section_size (abfd, sec, size);

  /* put in the symbol table */
  bfd_set_symtab (abfd, symtab, symptr);

  /* finish it */
  if (!bfd_make_readable (abfd)) {
      fprintf( stderr, "Link Error: can't make stack readable\n");
      abort();
    }
  /* set section flags & attributes again, because the call to
     bfd_make_readable() loses them */
     sec = abfd->sections;
     flags = SEC_LINKER_CREATED | SEC_KEEP;
     bfd_set_section_flags (abfd, sec, flags);
  return abfd;
} /* static bfd * bfd_pic32_create_stack_bfd (...)*/

/* This is called after all the input files have been opened.  */
void
pic32_after_open(void)
{
  lang_output_section_statement_type* os;

  os = lang_output_section_statement_lookup (".bev_excpt", 0, FALSE);

  if (pic32_coresident_app != 0)
    {
      ///\ remove section
      if (os!= NULL)
        {
	  if (os->bfd_section == NULL)
            {
	      os->bfd_section = bfd_make_section_anyway_with_flags(link_info.output_bfd, ".bev_excpt", SEC_EXCLUDE);
	      ///\ reset region
	      os->region = NULL;
            }
	  else
	    os->bfd_section->flags |= SEC_EXCLUDE;
        }
    }


  /*
  ** Merge full- and reduced-set I/O functions
  */
  if (pic32_smart_io)
    {
      PIC32_DEBUG("\nMerging smart-io functions:");

      smartio_merge_symbols ();

    } /* pic32_smart_io */

  /*
  ** For PIC, don't invoke the best-fit allocator.
  */
  if (link_info.shared || link_info.pie)
    pic32_allocate = FALSE;

  emultempl_after_open();

  /* Prepare a list for sections in user-defined regions */
  if (user_memory_sections)
    pic32_free_section_list(&user_memory_sections);
  pic32_init_section_list(&user_memory_sections);

  {
    /* loop through all of the input bfds */
    LANG_FOR_EACH_INPUT_STATEMENT (is)
      {
        if (!bfd_pic32_process_bfd_after_open(is->the_bfd, &link_info))
          {
            einfo("Errors encountered processing file %s\n", is->filename);
          }
      }
  }

  /*
  ** If a heap is required, but not provided
  ** as an input section, create one.
  **
  ** FIXME: may want to test pic32_stack_required
  ** and create a default size stack
  */
  if (!((link_info.shared || link_info.pie)) && 
      !stack_section_defined && (pic32_stack_size > 0)) {
    PIC32_DEBUG("\nCreating stack of size %x", pic32_stack_size);
    stack_bfd = bfd_pic32_create_stack_bfd (link_info.output_bfd);
    bfd_pic32_add_bfd_to_link (stack_bfd, stack_bfd->filename);
    stack_section_defined = TRUE;
  }
}


/******************************************
* STACK USAGE ESTIMATION                  *
*******************************************/

/*
* Stack Usage Estimation
*   check if r_type corresponds to a call semantic
*/
bfd_boolean is_call_reloc(unsigned int r_type)
{
    if (   (r_type == (unsigned int) R_MIPS_LO16)
        || (r_type == (unsigned int) R_MIPS_HI16)
        || (r_type == (unsigned int) R_MIPS_CALL16)
        || (r_type == (unsigned int) R_MIPS_CALL_HI16)
        || (r_type == (unsigned int) R_MIPS_CALL_LO16)
        || (r_type == (unsigned int) R_MIPS16_CALL16)
        || (r_type == (unsigned int) R_MICROMIPS_CALL16)
        || (r_type == (unsigned int) R_MICROMIPS_CALL_HI16)
        || (r_type == (unsigned int) R_MICROMIPS_CALL_LO16)
        || (r_type == (unsigned int) R_MICROMIPS_HI16)
        || (r_type == (unsigned int) R_MICROMIPS_LO16)
        || (r_type == (unsigned int) R_MIPS_26)
        || (r_type == (unsigned int) R_MIPS_PC16)
        || (r_type == (unsigned int) R_MIPS_PC21_S2)
        || (r_type == (unsigned int) R_MIPS_PC26_S2)
        || (r_type == (unsigned int) R_MIPS16_26)
        || (r_type == (unsigned int) R_MIPS16_PC16_S1)
        || (r_type == (unsigned int) R_MICROMIPS_26_S1)
        || (r_type == (unsigned int) R_MICROMIPS_PC7_S1)
        || (r_type == (unsigned int) R_MICROMIPS_PC10_S1)
        || (r_type == (unsigned int) R_MICROMIPS_PC16_S1)
        || (r_type == (unsigned int) R_MICROMIPS_PC23_S2)
        || (r_type == (unsigned int) R_MIPS_GOT16)
/* to check */
        || (r_type == (unsigned int) R_MIPS_32)
        || (r_type == (unsigned int) R_MIPS_TLS_DTPMOD32)
        || (r_type == (unsigned int) R_MIPS_TLS_GD)
        || (r_type == (unsigned int) R_MIPS_TLS_LDM)
        || (r_type == (unsigned int) R_MIPS_TLS_TPREL_HI16)
        || (r_type == (unsigned int) R_MIPS_TLS_TPREL_LO16)
    )
        return TRUE;
    return FALSE;
}

int32_t
pic32_su_rel_addend (bfd               *abfd,
                     asection          *section,
                     Elf_Internal_Rela *irela,
                     Elf_Internal_Sym  *isym)
{
  int32_t word;
  bfd_boolean rc;

  switch (ELF32_R_TYPE (irela->r_info)) {
  case R_MIPS_26:
    /*
       local:    ( ( (A << 2) | (P & 0xf0000000) ) + S ) >> 2
       external: ( sign_extend (A << 2) + S ) >> 2
    */
    rc = bfd_get_section_contents (abfd, section, &word, irela->r_offset, 4);
    BFD_ASSERT (rc);

    word = (word << 2) & 0x0FFFFFFFF;

    /* sign-extend if not local */
    if (ELF32_ST_BIND (isym->st_info) != STB_LOCAL
        || ELF32_ST_TYPE (isym->st_info) == STT_SECTION)
      {
        word = word << 4 >> 4;
      }

    return word;

  case R_MIPS_32:
    rc = bfd_get_section_contents (abfd, section, &word, irela->r_offset, 4);
    BFD_ASSERT (rc);
    return word;

  default:
    return 0;
  }
}



/* Print the memory reports iff a valid license is found
 * and report-mem option was used.
 * Dump the report in map file if a map was specified or at
 * stdout otherwise.
 */
static void print_memory_reports(void)
{
  /* XC32-2375: always put the reports in map file
   * if -Map was provided
   */
  if (config.map_file != NULL)
    {
      bfd_pic32_report_memory_usage (config.map_file);
      bfd_pic32_report_memory_usage_by_module (config.map_file);
    }

  /* No memory report if mafrlcsj was provided */
  if (pic32_mafrlcsj || pic32_mafrlcsj2)
    return;


  /* XC32-2375: dump the memory reports to stdout only
   * if --report-mem is enabled
   */
  if (!pic32_report_mem)
    return;

  bfd_pic32_report_memory_usage (stdout);
  bfd_pic32_report_memory_usage_by_module (stdout);
}

