zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
/*
** finish()
**
** This function is called after symbol assignments
** are completed, but before relocations are resolved.
*/
void
pic32_finish(void)
{
  /* MERGE-NOTES: hopefully the final resting place for strip_sections.
     after lang_size_sections and allocation, before map_segments. */
  pic32_strip_sections (link_info.output_bfd);

  need_layout = bfd_elf_discard_info (link_info.output_bfd,
  				      &link_info);

  /* We need to map segments here so that we determine file positions for 
     sections added by best-fit-allocator */
  emultempl_map_segments (need_layout);

  bfd_pic32_finish();


  if (pic32_stack_usage) {
    pic32_stack_estimation_run ();
  }

  print_memory_reports();

  if (pic32_has_crypto_option)
    pic32_report_crypto_sections();

  /* Output memory descriptor file for IDE */
  if (pic32_memory_summary)
   bfd_pic32_memory_summary(memory_summary_arg);

  finish_default();
} /* static void pic32_finish ()*/

/* Place an orphan section.  We use this to put random SHF_ALLOC
   sections in the right segment.  */

/* NB: the return type is only used here as NULL for failure,
   or non-NULL for success. The returned pointer is not usable otherwise. */
lang_output_section_statement_type *
pic32m_place_orphan (lang_input_statement_type *file,
		     asection *sec,
		     const char *secname ATTRIBUTE_UNUSED,
		     int constraint ATTRIBUTE_UNUSED)
{
    /* lghica co-resident */
    struct pic32_section *s;
    unsigned long was_placed = 0;

  if (pic32_allocate) {  /* if best-fit allocator enabled */

    /* if this section represents a memory region,
       we don't want it allocated or its relocations
       processed. */
    if ( PIC32_IS_INFO_ATTR(sec) &&
         strncmp(sec->name, memory_region_prefix, strlen(memory_region_prefix)) == 0 &&
         strchr(sec->name, '@') == NULL) {

      PIC32_DEBUG("LG - memory region - %s", sec->name);


      if (!memory_region_list)
        pic32_init_section_list(&memory_region_list);

      if (!pic32_name_in_section_list(memory_region_list, sec->name))
        pic32m_append_section_to_list(memory_region_list, file, sec);
      has_user_defined_memory = TRUE;
      return (lang_output_section_statement_type *) 1ul;
    }

   if (((sec->flags & SEC_DEBUGGING) == SEC_DEBUGGING)
        || ((sec->flags & SEC_ALLOC) == 0))
      return NULL; /* let the base code handle non-alloc sections */

    if (PIC32_IS_PRESERVED_ATTR(sec))
    {
        for (s = inherited_sections; s != NULL; s= s->next)
        {
            if (s->sec && (strcmp(sec->name, s->sec->name) == 0)
                    && (sec->rawsize == s->sec->rawsize))
            {
                PIC32_SET_ABSOLUTE_ATTR(sec);
                bfd_set_section_vma(sec->owner, sec, s->sec->vma);
            }
        }
    }


    if (!unassigned_sections)
      pic32_init_section_list(&unassigned_sections);

    pic32m_append_section_to_list(unassigned_sections, file, sec);

    return (lang_output_section_statement_type *) 1ul;  /* and exit */
  }

   return (lang_output_section_statement_type *) was_placed;
} /*static int gldelf32pic32mx_place_orphan () */

/*
** Append a section to a list
*/
/*static*/ void
pic32m_append_section_to_list (struct pic32_section *lst,
                              lang_input_statement_type *file,
                              asection *sec)
{
  struct pic32_section *s, *tail, *new;

  if (!(lst))
    return;
  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  new->next  = 0;
  new->sec  = sec;
  new->pic32_size = sec->size;
  new->attributes = pic32_attribute_map(sec);
  new->file = (PTR) file;
  new->dinit_type = -1;
  new->children = NULL;
  new->use_vma = 0;
  new->region = NULL;

  /* find the tail */
  for (s = lst; s != NULL; s = s->next)
    tail = s;

  tail->next = new;  /* add it */
}

/*
 * See if a section name matches
 * the unique section list. Truncate
 * section names at the % char, which
 * is used to differentiate orphan sections
 * with the same names.
 */
bfd_boolean
pic32_unique_section(const char *s)
{
  struct unique_sections *unam;
  const char *us;

  for (unam = unique_section_list; unam; unam = unam->next) {
    us = unam->name;
    while (*us) {
      if (*us++ != *s++) continue;
      if ((*s == '%') || (*s == '0'))  return TRUE;
    }
  }
  return FALSE;
}


/*
** Length of a section list
*/
int
pic32_section_list_length (lst)
     struct pic32_section *lst;
{
  struct pic32_section *s;
  int count = -1; /* first element is null */

  for (s = lst; s != NULL; s = s->next)
      count++;

  return count;

} /* pic32_section_list_length (..) */

/*
** Print a section list
*/
void
pic32_print_section_list (lst, name)
     struct pic32_section *lst;
      const char *name;
{
  unsigned int opb = bfd_octets_per_byte (link_info.output_bfd);
  struct pic32_section *s, *prev, *next;

  LOG("\nContents of %s section list at %lx:\n", name, (bfd_vma) lst);
  prev = lst;
  for (s = prev; s != NULL; s = next)
    {
      next = s->next;
      LOG("  name = %s, addr = %lx, len = %lx, attr = %x\n",
             s->sec ? s->sec->name : "(none)",
             s->sec ? s->sec->lma : 0,
             s->sec ? s->sec->rawsize / opb : 0,
             s->attributes);
      prev = s;
    }
  LOG("\n");

} /* pic32_print_section_list (..) */

/*
** Add a node to a memory list
**  in order of increasing size
*/
struct pic32_memory*
pic32_add_to_memory_list (lst, addr, size)
    struct pic32_memory *lst;
    bfd_vma addr, size;
{
    struct pic32_memory *new, *b, *prev;
    int done = 0;

    /* create a new element */
    new = ((struct pic32_memory *)
    xmalloc(sizeof(struct pic32_memory)));
    new->addr  = addr;
    new->size  = size;
    new->offset = 0;
    //new->section = NULL;

    /* insert it at the right spot */
    prev = lst;
    for (b = prev; b != NULL; b = b->next)
    {
        if (new->size < b->size)
        {
            prev->next = new;
            new->next = b;
            done++;
            break;
        }
        prev = b;
    }

