zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
/*
** This routine is called by bfd_pic32_create_data_init_template().
**
** Scan a DATA or BSS section and accumulate
** the data template size.
*/
static void
bfd_pic32_scan_data_section (sect, p)
     asection *sect;
     PTR p;
{
#define DATA_RECORD_HEADER_SIZE 12

   int *data_size = (int *) p;

  if (p == (int *) NULL)
    return;

  /*
  ** skip persistent or noload data sections
  */
  if (PIC32_IS_PERSIST_ATTR(sect) || PIC32_IS_NOLOAD_ATTR(sect))
  {
      /*
      ** issue a warning if DATA values are present
      */
      if ((sect->flags & SEC_DATA) && (sect->size > 0) && (sect->linked == 1))
        einfo(_("%P: Warning: initial values were specified for a non-loadable"
                " data section (%s). These values will be ignored.\n"),
              sect->name);

      PIC32_DEBUG("  %s (skipped), size = %x bytes",
		  sect->name, (unsigned int) sect->size);
      return;
  }

   /*
  ** process BSS-type sections
  */
  if ((PIC32_SECTION_IS_BSS_TYPE(sect) || PIC32_IS_BSS_ATTR_WITH_MEMORY_ATTR(sect)) &&
      (sect->size > 0))
  {
      *data_size += DATA_RECORD_HEADER_SIZE;
      PIC32_DEBUG("  %s (bss), size = %x bytes, template += %x bytes",
		  sect->name, (unsigned int) sect->size,
		  DATA_RECORD_HEADER_SIZE);
  }

  /*
  ** process DATA-type sections
  */
  if ((PIC32_IS_DATA_ATTR(sect) || PIC32_IS_DATA_ATTR_WITH_MEMORY_ATTR(sect) || PIC32_IS_RAMFUNC_ATTR(sect)) && (sect->size > 0))
  {
    /* Analyze initialization data now and find out what the after compression
       size of the data initialization template */
          /* account for 0-padding so that new dinit records always start at a 
          ** new memory location 
          */
	  int count = (sect->size % 4) ? (sect->size + (4 - sect->size % 4)) \
                                       : sect->size;
          int delta = DATA_RECORD_HEADER_SIZE + count;
          *data_size += delta;
      /*
      ** make section not LOADable
      */
      sect->flags &= ~ SEC_LOAD;

      PIC32_DEBUG("  %s (data), size = %x bytes, template += %x bytes",
		  sect->name, (unsigned int) sect->size, delta);
  }
} /*static void bfd_pic32_scan_data_section (...)*/

/*
** This routine is called by bfd_pic32_create_data_init_template().
**
** Scan a CODE  sections and accumulate
** the data template size.
*/
static void
bfd_pic32_scan_code_section (sect, p)
     asection *sect;
     PTR p;
{
#define DATA_RECORD_HEADER_SIZE 12

   int *data_size = (int *) p;

  if (p == (int *) NULL)
    return;

  /*
  ** process CODE-type sections
  */
  if (PIC32_IS_CODE_ATTR(sect) && (sect->size > 0))
  {
    /* Analyze initialization data now and find out what the after compression
       size of the data initialization template */
          /* account for 0-padding so that new dinit records always start at a
          ** new memory location
          */
          int count = (sect->size % 4) ? (sect->size + (4 - sect->size % 4)) \
                                       : sect->size;
          int delta = DATA_RECORD_HEADER_SIZE + count;
          *data_size += delta;
      /*
      ** make section not LOADable
      */
      sect->flags &= ~ SEC_LOAD;

      PIC32_DEBUG("  %s (data), size = %x bytes, template += %x bytes",
		  sect->name, (unsigned int) sect->size, delta);
  }
} /*static void bfd_pic32_scan_code_section (...)*/



/*
** This routine is called by before_allocation()
** when the --no-data-init option is specified.
**
** Scan for loadable DATA sections...if found,
** mark them NEVER_LOAD and issue a warning.
*/
static void
bfd_pic32_skip_data_section (sect, p)
     asection *sect;
     PTR p ATTRIBUTE_UNUSED ;
{
  /*
  ** process DATA-type sections
  */
  if (((sect->flags & SEC_DATA) == SEC_DATA) && (sect->size > 0))
  {
      /*
      ** make section not LOADable
      */
      sect->flags &= ~ SEC_LOAD;
      sect->flags |= SEC_NEVER_LOAD;

      /*
      ** issue a warning (unless the linker is called with "-r" to link together 
      ** the debug-info objects)
      */
      if (! bfd_link_relocatable (&link_info))
        einfo(_("%P: Warning: data initialization has been turned off,"
                " therefore section %s will not be initialized using .dinit template.\n"), sect->name);

      PIC32_DEBUG("  %s (skipped), size = %x",
		  sect->name, (unsigned int) sect->size);
  }
}

/*
** Create a new section
*/
asection *
bfd_pic32_create_section (abfd, name, flags, align)
     bfd *abfd;
     const char *name;
     int flags;
     int align;
{
  asection *sec;
  asymbol *sym;

  PIC32_DEBUG("\nCreating input section \"%s\"", name);

  /* do NOT call bfd_make_section_old_way(), its buggy! */
  sec = bfd_make_section_anyway (abfd, name);
  bfd_set_section_flags (abfd, sec, flags | SEC_ALLOC | SEC_KEEP | SEC_LINKER_CREATED);
  bfd_set_section_alignment (abfd, sec, align);
  /* Set the gc mark to prevent the section from being removed by garbage
     collection, despite the fact that no relocs refer to this section.  */
  sec->gc_mark = 1;
  sec->output_section = sec;

  /* add a symbol for the section name */
  sym = bfd_make_empty_symbol (abfd);
  symtab[symptr++] = sym;
  sym->name = sec->name;
  sym->section = sec;
  sym->flags = BSF_LOCAL;
  sym->value = 0;

  return sec;
} /* static asection * bfd_pic32_create_section (...)*/

static bfd_boolean is_debug_section(asection* const sec)
{
    if ((strstr(sec->name, "debug") != 0) &&
        ((sec->flags & SEC_LOAD) ==0))
        return TRUE;

return FALSE;
}

/*
*  mark sections as absolute and linked
*/
static void pic32_mark_linked_sections(bfd* abfd)
{
    asection *sec;

    for (sec = abfd->sections; sec != NULL; sec = sec->next)
    {
        if (((sec->size != 0) || (sec->rawsize != 0))
            && ((sec->flags & SEC_EXCLUDE) == 0)
            && ((sec->flags & SEC_LOAD) != 0))
        {
            PIC32_SET_ABSOLUTE_ATTR(sec);
            sec->linked = 1;
        }
        ///\ looking for non-loadable debug sections & mark them as linked
        ///\ for co-resident
        if (is_debug_section(sec))
        {
            sec->linked = 1;
        }
    }
}

