zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
/*
** Strip zero-length sections
*/
static void
pic32_strip_sections (abfd)
     bfd *abfd;
{
  asection *sec, *prev;

  PIC32_DEBUG("\nLooking for zero-length sections:");

  sec = abfd->sections;
  if ((sec == NULL) || (sec->next == NULL))
    return;

  sec = sec->next; /* never strip the first section */
  /* loop through the sections in this bfd */
  for (; sec != NULL; sec = sec->next)
    {
      /* don't touch the keep/linker created sections */
      if (sec->flags & (SEC_KEEP | SEC_LINKER_CREATED))
        continue;
      /* remove sections with size = 0 */
      if (sec->size == 0)
      {
        prev = sec->prev;
        prev->next = sec->next;
        if (sec->next)
          sec->next->prev = prev; 
        else
          abfd->section_last = prev; /*update the bfd->section_last field
                                       if the removed section is the 
                                       last section.*/
        abfd->section_count -= 1;
	PIC32_DEBUG("  Stripping section %s", sec->name);
      }
    }
  return;
} /* static void pic32_strip_sections (...)*/


void
bfd_pic32_finish(void)
{
  struct bfd_link_hash_entry *h;
  asection *stack_sec;
  lang_output_section_statement_type *os;
  lang_memory_region_type *region;
  bfd_vma end_data_mem;

    /* lghica co-resident */
    char* alias_name = 0;

 /*
  ** remove output sections with size = 0
  */
/* MERGE-NOTES: it seems that this is too late; map_segments will die
  if we feed it zero-length sections, which have garbage flags. */
/*
  pic32_strip_sections(link_info.output_bfd);
*/

    /* lghica co-resident */
    if (pic32_application_id)
    {
        alias_name = xmalloc(1+ strlen(application_id) + 80);/* TODO check 80 */
    }

    ///\ lghica - coresident
    pic32_mark_linked_sections(link_info.output_bfd);

  /* if we've encountered a fatal error, stop here */
  if (config.make_executable == FALSE)
    einfo("%P%F: Link terminated due to previous error(s).\n");

// PIE SUPPORT

if (!(link_info.shared || link_info.pie)) 
{
  /* check for _min_stack_size symbol -- this is an old way to specify
     a stack, and is really not preferred */
  if ((h = bfd_pic32_is_defined_global_symbol("_min_stack_size"))) {
    if (pic32_has_stack_option && (h->u.def.value != pic32_stack_size))
      fprintf (stderr, "Warning: --stack option overrides _min_stack_size symbol\n");
    else
      pic32_stack_size = h->u.def.value;
  }

   /* if heap is required, make sure one is specified */
  if (pic32_heap_required && !heap_section_defined && !pic32_has_heap_option &&
      !bfd_pic32_is_defined_global_symbol("_min_heap_size"))
      einfo("%P%X Error: A heap is required, but has not been specified\n");

  /* check for _min_stack_size symbol -- this is an old way to specify
     a stack, and is really not preferred */
  if ((h = bfd_pic32_is_defined_global_symbol("_min_heap_size"))) {
    if (pic32_has_heap_option && (h->u.def.value != pic32_heap_size))
      fprintf (stderr, "Warning: --heap option overrides _min_heap_size symbol\n");
    else
      pic32_heap_size = h->u.def.value;
  }

  /*
  ** Check for user-defined stack
  **
  ** note: symbol (_stack) must be defined
  */
  if ((h = bfd_pic32_is_defined_global_symbol("_stack"))) {
    user_defined_stack = TRUE;
    stack_base = h->u.def.value;
    /* if defined value is relative, add in the section base address */
    if (h->u.def.section && (h->u.def.section != bfd_abs_section_ptr))
      stack_base += h->u.def.section->vma;
  }
  else
    user_defined_stack = FALSE;

  /* If a stack was not defined as a section, or by symbols,
     allocate one from remaining memory */
  if (!user_defined_stack) {
    allocate_default_stack();

    /* lghica co-resident */
#define link_add_one_symbol(link_info, output_bfd, name, \
                            type, section, heap_base, name2, a,b,c) \
    _bfd_generic_link_add_one_symbol(link_info, output_bfd, name, \
                            type, section, heap_base, name2, a,b,c); \
    if (pic32_application_id) { \
        (void)sprintf(alias_name, "_%s%s", application_id, name); \
        _bfd_generic_link_add_one_symbol(link_info, output_bfd, alias_name, \
                            type, section, heap_base, alias_name, a,b,c); \
    }


  /*
  ** Set stack symbols for the runtime library
  */
      PIC32_DEBUG("Creating _heap = %x", heap_base);
      /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_heap",
                                        PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                        heap_base, "_heap", 1, 0, 0);
      PIC32_DEBUG("Creating _eheap = %x", heap_limit);
      /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_eheap",
                                        PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                        heap_limit, "_eheap", 1, 0, 0);

      PIC32_DEBUG("Creating _splim = %x", stack_base);
      /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_splim",
                                        PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                        stack_base, "_splim", 1, 0, 0);
      /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_SPLIM",
                                        PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                        stack_base, "_SPLIM", 1, 0, 0);

      stack_sec = bfd_get_section_by_name(stack_bfd, ".stack");
      if (stack_sec)
        {
          etree_type *addr_tree;
          os = lang_output_section_statement_lookup (".stack", 0, TRUE);
          stack_sec->size = pic32_stack_size;
          if (os->bfd_section != NULL)
          {
            bfd_set_section_size (stack_bfd, stack_sec, pic32_stack_size);
            bfd_set_section_vma (stack_bfd, stack_sec, stack_base);
            os->bfd_section->vma = stack_sec->vma;
            os->bfd_section->lma = stack_sec->lma;
            os->bfd_section->size = stack_sec->size;
            stack_sec->flags |= SEC_LINKER_CREATED;
            os->bfd_section->flags = stack_sec->flags;
            addr_tree = xmalloc(sizeof(etree_type));
            addr_tree->value.type.node_class = etree_value;
            addr_tree->value.value = stack_sec->vma;
            os->addr_tree = addr_tree;
	    PIC32_DEBUG("Creating _stack = %x", stack_limit);
            /*_bfd_generic_*/link_add_one_symbol (&link_info, stack_sec->owner, "_stack",
                                              PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                              stack_limit, "_stack", 1, 0, 0);
                                              
