zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
          }
          else
            fprintf( stderr, "Link Error: Unable to allocate stack\n");
        }

  }

  /* Range check the stack, no matter how it was created */
  if ( (int) (stack_limit - stack_base) < (int) pic32_stack_size)
    {
      einfo("%P%X Error: Not enough memory for stack"
            " (%d bytes needed, %d bytes available)\n",
            pic32_stack_size + pic32_stackguard_size,
            (int) (stack_limit - stack_base) + pic32_stackguard_size);
    }

  PIC32_DEBUG("Creating __MIN_STACK_SIZE = %x", pic32_stack_size);
  /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "__MIN_STACK_SIZE",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    pic32_stack_size, "__MIN_STACK_SIZE", 1, 0, 0);
  PIC32_DEBUG("Creating _min_stack_size = %x", pic32_stack_size);
  /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_min_stack_size",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    pic32_stack_size, "_min_stack_size", 1, 0, 0);

  PIC32_DEBUG("Creating __MIN_HEAP_SIZE = %x", pic32_heap_size);
  /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "__MIN_HEAP_SIZE",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    pic32_heap_size, "__MIN_HEAP_SIZE", 1, 0, 0);
  PIC32_DEBUG("Creating _min_heap_size = %x", pic32_heap_size);
  /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_min_heap_size",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    pic32_heap_size, "_min_heap_size", 1, 0, 0);

  end_data_mem = stack_limit;

  if (pic32_is_l1cache_machine(global_PROCESSOR))
  {
    /* Try to use kseg0_data_mem, but fall back to kseg1_data_mem. */
    if (lang_memory_region_exist("kseg0_data_mem"))
      region = region_lookup ("kseg0_data_mem");
    else if (lang_memory_region_exist("kseg1_data_mem"))
      region = region_lookup ("kseg1_data_mem");
    else
      region = region_lookup ("kseg0_data_mem");
  }
  else
  {
    /* Try to use kseg1_data_mem, but fall back to kseg0_data_mem. */
    if (lang_memory_region_exist("kseg1_data_mem"))
      region = region_lookup ("kseg1_data_mem");
    else if (lang_memory_region_exist("kseg0_data_mem"))
      region = region_lookup ("kseg0_data_mem");
    else
      region = region_lookup ("kseg1_data_mem");
  }

  if (region) {
    end_data_mem = region->origin + region->length;
  }

  if (!bfd_pic32_is_defined_global_symbol("_ramfunc_begin"))
  {
    /* If there are no ram fumctions, add the _ramfunc_begin symbol with value 0 */
    /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_ramfunc_begin",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    0, "_ramfunc_begin", 1, 0, 0);
  }
  if (!bfd_pic32_is_defined_global_symbol("_bmxdkpba_address"))
  {
    /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_bmxdkpba_address",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    end_data_mem - region->origin, "_bmxdkpba_address", 1, 0, 0);
  }
  if (!bfd_pic32_is_defined_global_symbol("_bmxdudba_address"))
  {
    /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_bmxdudba_address",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    region->length, "_bmxdudba_address", 1, 0, 0);

    /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_bmxdupba_address",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    region->length, "_bmxdupba_address", 1, 0, 0);
  }
  if (!bfd_pic32_is_defined_global_symbol("_bmxdupba_address"))
  {
    /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd, "_bmxdupba_address",
                                    PIC32_CORESIDENT/*BSF_GLOBAL*/, bfd_abs_section_ptr,
                                    region->length, "_bmxdupba_address", 1, 0, 0);
  }

  /*
  ** Set _dinit_addr symbol for data init template
  **   so the C startup module can find it.
  */

  if (pic32_data_init)
    {
      asection *sec;
      sec = init_template->output_section;  /* find the template's output sec */

      if (sec)
        {
          bfd_vma dinit_addr = sec->lma + init_template->output_offset;
          unsigned int dinit_addr_32 = dinit_addr & 0xFFFFFFFFul;

	  PIC32_DEBUG("Creating _dinit_addr= %x", dinit_addr_32);
          /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd,
                                            "_dinit_addr", PIC32_CORESIDENT /* BSF_GLOBAL */,
                                            bfd_abs_section_ptr, dinit_addr_32,
                                            "_dinit_addr", 1, 0, 0);
	  PIC32_DEBUG("Creating _dinit_size= %x", dinit_size);
          /*_bfd_generic_*/link_add_one_symbol (&link_info, link_info.output_bfd,
                                            "_dinit_size", PIC32_CORESIDENT /* BSF_GLOBAL */,
                                            bfd_abs_section_ptr, dinit_size,
                                            "_dinit_size", 1, 0, 0);
        }

        if (init_shared_template != NULL)
        {
            ///\ coresident - if shared data ...
            sec = init_shared_template->output_section;  /* find the shared */
                                                     /* template's output sec */
            if (sec)
            {
                bfd_vma shared_dinit_addr = sec->lma + init_shared_template->output_offset;
		PIC32_DEBUG("Creating __shared_dinit_addr = %lx", shared_dinit_addr);
                link_add_one_symbol (&link_info, link_info.output_bfd,
                                    "__shared_dinit_addr",
                                    BSF_GLOBAL | BSF_WEAK,
                                    bfd_abs_section_ptr,
                                    shared_dinit_addr,
                                    "__shared_dinit_addr", 1, 0, 0);
            }
        }
    }
 } // PIE SUPPORT

#if 1
if (link_info.shared || link_info.pie)
 {
   /* if heap is required, make sure one is specified */

   if (pic32_heap_required && !heap_section_defined && !pic32_has_heap_option &&
	  !bfd_pic32_is_defined_global_symbol("_min_heap_size"))
	  einfo("%P%X Error: A heap is required, but has not been specified\n");

   /* check for _min_stack_size symbol -- this is an old way to specify
	 a stack, and is really not preferred */
   if ((h = bfd_pic32_is_defined_global_symbol("_min_heap_size"))) {
	if (pic32_has_heap_option && (h->u.def.value != pic32_heap_size))
	  fprintf (stderr, "Warning: --heap option overrides _min_heap_size symbol\n");
	else
	  pic32_heap_size = h->u.def.value;
   }
  
   PIC32_DEBUG("Creating __MIN_HEAP_SIZE = %x", pic32_heap_size);
  
