zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
  if (!bfd_pic32_is_defined_global_symbol("__MIN_HEAP_SIZE"))
   _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "__MIN_HEAP_SIZE",
									BSF_GLOBAL, bfd_abs_section_ptr,
									pic32_heap_size, "__MIN_HEAP_SIZE", 1, 0, 0);
//  PIC32_DEBUG("Creating _min_heap_size = %x", pic32_heap_size);
//  
//  if (!bfd_pic32_is_defined_global_symbol("_min_heap_size"))
//   _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_min_heap_size",
//									BSF_GLOBAL, bfd_abs_section_ptr,
//									pic32_heap_size, "_min_heap_size", 1, 0, 0);  
 PIC32_DEBUG("Creating _heap = %x", heap_base);
     
   if (!bfd_pic32_is_defined_global_symbol("_heap"))
     _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_heap",
                                        BSF_GLOBAL, bfd_abs_section_ptr,
                                        heap_base, "_heap", 1, 0, 0);
	
   PIC32_DEBUG("Creating _eheap = %x", heap_limit);

   if (!bfd_pic32_is_defined_global_symbol("_eheap"))
     _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_eheap",
                                        BSF_GLOBAL, bfd_und_section_ptr,
                                        heap_limit, "_eheap", 1, 0, 0);


  /*
  ** Set _dinit_addr symbol for data init template
  **   so the C startup module can find it.
  */
  if (pic32_data_init)
    {
      asection *sec;
      sec = init_template->output_section;  /* find the template's output sec */

      if (sec)
        {
          bfd_vma dinit_addr = sec->lma + init_template->output_offset;
          unsigned int dinit_addr_32 = dinit_addr & 0xFFFFFFFFul;

	  PIC32_DEBUG("Creating _dinit_addr= %x", dinit_addr_32);
          _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
                                            "_dinit_addr", PIC32_CORESIDENT /* BSF_GLOBAL */,
                                            bfd_abs_section_ptr, dinit_addr_32,
                                            "_dinit_addr", 1, 0, 0);
	  PIC32_DEBUG("Creating _dinit_size= %x", dinit_size);
          _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
                                            "_dinit_size", PIC32_CORESIDENT /* BSF_GLOBAL */,
                                            bfd_abs_section_ptr, dinit_size,
                                            "_dinit_size", 1, 0, 0);
        }
    }
									
  } // PIE SUPPORT
#endif

    /* lghica co-resident */

    /* clean the section names */
    PIC32_DEBUG("\nCleaning section names:");
    bfd_map_over_sections(link_info.output_bfd, &bfd_pic32_clean_section_names, 0);

    asection *s;
    for (s = link_info.output_bfd->sections; s != NULL; s= s->next)
    {
        if (s->name && (strcmp(s->name, ".shared.dinit") == 0) &&
                ((s->flags & SEC_EXCLUDE) == 0))
            pic32m_append_section_to_list(shared_dinit_sections, 0, s);
    }

    for (s = link_info.output_bfd->sections; s != NULL; s= s->next)
    {
        ///\ mark as linked all debug sections
        if ((!PIC32_IS_INFO_ATTR(s)) || (strstr(s->name, "debug") != NULL) )
        {
            ///\ fix to prevent absolute .comment sections
            if (strcmp(s->name, ".comment") == 0)
                continue;
            if (s->linked == 1)
            {
                char *name;
                char *linked_prefix = "__linked_";

                name = xmalloc (strlen(s->name) + strlen(linked_prefix) + 1);
                (void) sprintf(name, "%s%s", linked_prefix, s->name);

                _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
                            name, BSF_GLOBAL,
                            bfd_abs_section_ptr, 1,
                            name, 1, 0, 0);

                if ((PIC32_IS_DATA_ATTR(s) || PIC32_IS_BSS_ATTR(s))
                        && !PIC32_IS_SHARED_ATTR(s))
                    continue;
                else if (strcmp(s->name, ".reset") == 0)
                    PIC32_SET_ABSOLUTE_ATTR(s);
            }
        }
    }
}

void
pic32m_after_allocation (void)
{
  /* MERGE-NOTES: it seems the order of various things may have changed
     between the initial mips and arm versions. the order of these things
     is different in various ways in pic32c. */
#if 0 /* NO  - this is in pic32_finish now */
   /* If any sections are discarded then relocations of symbols referenced
      in sections like .eh_frame, .stab, .pdr will be removed. Also entries 
      these sections may be removed to eleminate duplication. 
      So the size will change. If we don't map_segments before 
      best-fit-allocation overlapping may occur. */
   need_layout = bfd_elf_discard_info (link_info.output_bfd,
                                                  &link_info);

   emultempl_map_segments (need_layout);
#endif

#ifdef TARGET_IS_PIC32MX
    /* lghica - co-resident */
    if (pic32_pad_flash_option)
        bfd_pic32_pad_flash();
#endif

/*
** Invoke the best-fit allocator
*/
  if (pic32_allocate) {
    allocate_memory();
  }

  /* MERGE-NOTES: let's just try stripping sections here? */
  /* absolutely not - we can only strip afteer lang_size_sections is called,
     since otherwise most sections will be unsized and removed. */
  /*
  pic32_strip_sections (link_info.output_bfd);
  */
  
#ifdef TARGET_IS_PIC32MX
  if (pic32_has_fill_option)
    pic32_create_fill_templates();
#endif
}

/*
** Return a pointer to bfd_link_hash_entry
** if a global symbol is defined;
** else return zero.
*/
struct bfd_link_hash_entry *
bfd_pic32_is_defined_global_symbol (name)
     const char *const name;
{
    struct bfd_link_hash_entry *h;
    h = bfd_link_hash_lookup (link_info.hash, name, FALSE, FALSE, TRUE);

    if ((h != (struct bfd_link_hash_entry *) NULL) &&
        (h->type == bfd_link_hash_defined))
      return h;
    else
      return (struct bfd_link_hash_entry *) NULL;
}

/*
** Create a bfd for the fill templates
**
** Uses the following global variables:
**   symtab
**   symptr
*/
static bfd *
bfd_pic32_create_fill_bfd (parent)
     bfd *parent ATTRIBUTE_UNUSED;
{
  bfd_size_type size;
  bfd *abfd;
  asection *sec;
  char *oname;
  int flags, sec_align;
  const char *sname;

  /* create a bare-bones bfd */
  oname = (char *) bfd_alloc (link_info.output_bfd, 20);
  sprintf (oname, "fill%d", fill_section_count);
  abfd = bfd_create (oname, parent);
  bfd_find_target (EMULTEMPL.output_format, abfd);
  bfd_make_writable (abfd);

  bfd_set_format (abfd, bfd_object);
  bfd_set_arch_mach (abfd, bfd_arch_mips, 0);

