zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
  /* create a symbol table (room for 1 entry) */
  symptr = 0;
  symtab = (asymbol **) bfd_alloc (link_info.output_bfd, 2 * sizeof (asymbol *));

  /*
  ** create a bare-bones section for
  */
  /* get unique section name */
  sname = bfd_get_unique_section_name (abfd, "fill$", &fill_section_count);
  flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP |
          SEC_LINKER_CREATED;
  sec_align = 0; 
  sec = bfd_pic32_create_section (abfd, sname, flags, sec_align);
  size = 0; /* will update later */
  bfd_set_section_size (abfd, sec, size);

  /* put in the symbol table */
  bfd_set_symtab (abfd, symtab, symptr);
  /* finish it */
  if (!bfd_make_readable (abfd))
    {
      fprintf( stderr, "Link Error: can't make fill readable\n");
      abort();
    }
  return abfd;
} /* static bfd * bfd_pic32_create_fill_bfd (...)*/

void pic32_create_fill_templates(void)
{
  struct pic32_fill_option *o;
  if (program_memory_free_blocks)
    {
      if (pic32_fill_option_list)
        {
         for (o = pic32_fill_option_list; o != NULL; o = o->next)
            {
              if (o == pic32_fill_option_list)
                continue;

              if (o->loc.unused)
                pic32_create_unused_program_sections(o);
            }

        }
     }
   else
     einfo(_("%P: Warning: There is not any free program memory to fill.\n"));
}

static void pic32_create_unused_program_sections
                      (struct pic32_fill_option *opt)
{
  asection * sec;
  struct pic32_memory *b, *next;
  bfd *fill_bfd;
  unsigned char *fill_data;
  struct pic32_section *s;
  struct memory_region_struct *region;
  bfd_vma size = 0;
  bfd_vma addr = 0;
  int sec_align = 2;

  for (b = program_memory_free_blocks; b != NULL; b = next)
    {
     next = b->next;
     if ((b->addr == 0) && (b->size == 0))
      continue;
     fill_bfd = bfd_pic32_create_fill_bfd(link_info.output_bfd);
     bfd_pic32_add_bfd_to_link (fill_bfd, fill_bfd->filename);
     
     addr = align_power(b->addr, sec_align); /*align to an instruction word*/
     size = b->size - (addr - b->addr);
    

     fill_bfd->sections->vma = fill_bfd->sections->lma = addr;
     fill_bfd->sections->rawsize = size;
     fill_bfd->sections->size = size;

       /* create a pic32_section */
     pic32_init_section_list(&s);
     s->sec = fill_bfd->sections;
     LANG_FOR_EACH_INPUT_STATEMENT (file)
      {
       if (strcmp(file->filename, fill_bfd->filename) == 0)
        s->file = (PTR) file;
      }
       /* allocate memory for the template */
     fill_data = (unsigned char *) bfd_alloc (link_info.output_bfd, size);
     if (!fill_data)
      {
       fprintf( stderr, "Link Error: not enough memory for fill template\n");
       abort();
      }

       /* fill the template with a default value */
     fill_data = memset(fill_data, 0x11, size);

       /* attach it to the input section */
     sec = bfd_get_section_by_name(fill_bfd, fill_bfd->sections->name);
     if (sec)
      {
       sec->rawsize = size;
       sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE);
       sec->contents = fill_data;
       bfd_set_section_alignment(fill_bfd, sec, sec_align); /*align to an insn word*/
       bfd_set_section_size (fill_bfd, sec, size);
       fill_bfd->sections = sec;  /* save a copy for later */
      }
 else
   PIC32_DEBUG("after_open: section %s not found", sec->name);

     region = region_lookup ("kseg0_program_mem");

     update_section_info(addr, s, region);

     pic32m_append_section_to_list(opt->fill_section_list, 
                                  (lang_input_statement_type *)s->file, sec);
     pic32_remove_from_memory_list(program_memory_free_blocks, b);
    }

}

void pic32_create_specific_fill_sections(void)
{
  asection * sec;
  bfd *fill_bfd;
  unsigned char *fill_data;
  bfd_vma size;
  struct pic32_fill_option *o;

  for (o = pic32_fill_option_list->next; o != NULL; o = o->next)
    {
       if (o->loc.unused)
         continue;

       if (o->loc.end_address)
        size = (o->loc.end_address - o->loc.address) + 1;
       else if (o->fill_width == 1)
        size = 1;
       else if (o->fill_width == 2)
        size = 2;
       else if (o->fill_width == 8)
        size = 8;
       else
        size = 4;

       fill_bfd = bfd_pic32_create_fill_bfd(link_info.output_bfd);
       bfd_pic32_add_bfd_to_link (fill_bfd, fill_bfd->filename);

       fill_bfd->sections->vma = fill_bfd->sections->lma = o->loc.address;
       fill_bfd->sections->rawsize = size;
       fill_bfd->sections->size = size;

        /* allocate memory for the template */
       fill_data = (unsigned char *) bfd_alloc (link_info.output_bfd, size);
       if (!fill_data)
        {
         fprintf( stderr, "Link Error: not enough memory for fill template\n");
         abort();
        }

        /* fill the template with a default value */
       fill_data = memset(fill_data, 0x11, size);

        /* attach it to the input section */
       sec = bfd_get_section_by_name(fill_bfd,fill_bfd->sections->name );
       if (sec)
       {
        sec->rawsize = size;
        sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE);
        PIC32_SET_ABSOLUTE_ATTR(sec);
        sec->contents = fill_data;
        bfd_set_section_size (fill_bfd, sec, size);
        fill_bfd->sections = sec;  /* save a copy for later */
       }
      else
	PIC32_DEBUG("after_open: section %s not found", sec->name);

      pic32m_append_section_to_list(o->fill_section_list,
                                 (lang_input_statement_type *)NULL, sec);
   }
}

/* lghica co-resident */

/*
** Create a new symbol
**
** Uses the following global variables:
**   symtab
**   symptr
*/
static void
bfd_pic32_create_symbol(bfd *abfd, char *name, asection *sec,
                int flags, int addr)
{
asymbol *sym;

PIC32_DEBUG("  Adding symbol %s", name);

sym = bfd_make_empty_symbol (abfd);
sym->name = name;
sym->section = sec;
sym->flags = flags;
sym->value = addr;
symtab[symptr++] = sym;
} /* static void bfd_pic32_create_symbol (...)*/



static bfd *
bfd_pic32_create_pad_bfd (bfd *parent ATTRIBUTE_UNUSED)
{
    bfd_size_type   size;
    bfd             *abfd;
    asection        *sec;
    char            *oname;
    int             flags, align;
    const char      *sname;

    /* create a bare-bones bfd */
    oname = (char *) bfd_alloc (link_info.output_bfd, 20);
    sprintf (oname, "pad%d", pad_section_count);
    abfd = bfd_create (oname, parent);
    bfd_find_target (EMULTEMPL.output_format, abfd);
    bfd_make_writable (abfd);

    bfd_set_format (abfd, bfd_object);
    bfd_set_arch_mach (abfd, bfd_arch_mips, 0);

