zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
    /* create a symbol table (room for 1 entry) */
    symptr = 0;
    symtab = (asymbol **) bfd_alloc (link_info.output_bfd, sizeof (asymbol *));

    /*
    ** create a bare-bones section for
    */

    /* get unique section name */
    sname = bfd_get_unique_section_name (abfd, "pad$", &pad_section_count);
    flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY;
    align = 1; /* 2^1 */
    sec = bfd_pic32_create_section (abfd, sname, flags, align);
    size = 0; /* will update later */
    bfd_set_section_size (abfd, sec, size);

    /* put in the symbol table */
    bfd_set_symtab (abfd, symtab, symptr);
    /* finish it */
    if (!bfd_make_readable (abfd))
    {
        fprintf( stderr, "Link Error: can't make pad readable\n");
        abort();
    }
    return abfd;
}


/* lghica co-resident */

#define PAD_PATTERN     0x11


static void bfd_pic32_pad_flash()
{
    asection                    *sec;
    struct pic32_memory         *b, *next;
    bfd                         *pad_bfd;
    unsigned char               *pad_data;
    struct pic32_section        *s;
    struct memory_region_struct *region;
    bfd_vma                     size = 0;
    bfd_vma                     addr = 0;
    bfd_vma                     len = 0;
    bfd_vma                     pad_to = 0; /* instruction words */

    if (pad_flash_arg)
        pad_to = pad_flash_arg;
    else
    {
        /* einfo(_("%P%F: Warning: Flash padding size not specified.\n" )); */
        return;
    }


    if (program_memory_free_blocks)
    {
        if (lang_memory_region_exist("kseg0_program_mem"))
            region = region_lookup ("kseg0_program_mem");
        else if (lang_memory_region_exist("kseg1_program_mem"))
            region = region_lookup ("kseg1_program_mem");
        else
            ///\ todo - add warning
            return;

        pad_to = pad_to * 2;   /* PC-units */

        for (b = program_memory_free_blocks; b != NULL; b = next)
        {
            next = b->next;
            if ((b->addr == 0) && (b->size == 0))
                continue;
            if (b->addr % pad_to)
            {
                addr = b->addr;
                len = pad_to - (b->addr % pad_to);
            }
            else if (next && (b->size % pad_to))
            {
                len = b->size % pad_to;
                addr = b->addr + b->size - len;
                b->offset = addr - b->addr;
            }
            else
                len = 0;

            if (len)
            {
                size = len * 2;
                pad_bfd = bfd_pic32_create_pad_bfd(link_info.output_bfd);
                bfd_pic32_add_bfd_to_link (pad_bfd, pad_bfd->filename);

                pad_bfd->sections->vma = pad_bfd->sections->lma = addr;
                pad_bfd->sections->rawsize = size;
                pad_bfd->sections->size = size;

                /* create a pic32_section */
                pic32_init_section_list(&s);
                s->sec = pad_bfd->sections;

                LANG_FOR_EACH_INPUT_STATEMENT (file)
                {
                    if (strcmp(file->filename, pad_bfd->filename) == 0)
                        s->file = (PTR) file;
                }

                /* allocate memory for the template */
                pad_data = (unsigned char *) bfd_alloc (link_info.output_bfd, size);

                if (!pad_data)
                {
                    fprintf( stderr, "Link Error: not enough memory for data template\n");
                    abort();
                }

                /* fill the template with a default value */
                pad_data = memset(pad_data, PAD_PATTERN, size);

                /* attach it to the input section */
                sec = bfd_get_section_by_name(pad_bfd, pad_bfd->sections->name);

                if (sec)
                {
                    sec->rawsize = size;
                    sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE);
                    sec->contents = pad_data;
                    bfd_set_section_size (pad_bfd, sec, size);
                    pad_bfd->sections = sec;  /* save a copy for later */
                }
                else
		  PIC32_DEBUG("after_open: section %s not found", sec->name);

                update_section_info(addr, s, region);
                create_remainder_blocks(program_memory_free_blocks, b, len);
                pic32_remove_from_memory_list(program_memory_free_blocks, b);
                next = program_memory_free_blocks->next;
            }
        }
    }
}

/* lghica co-resident */
void pic32_create_shared_data_init_template(void)
{
    struct pic32_section    *s;
    int                     total_data = 0;
    asection                *sec;

    /*
    ** If data init support is enabled, create a BFD
    ** for section .dinit and add it to the link.
    */
    if (pic32_data_init)
    {
        init_shared_bfd = bfd_pic32_create_shared_data_init_bfd (link_info.output_bfd);
        bfd_pic32_add_bfd_to_link (init_shared_bfd, init_shared_bfd->filename);

        /* Compute size of data init template */
        for (s = shared_data_sections; s != NULL; s = s->next)
            if ((s->sec) && ((s->sec->flags & SEC_EXCLUDE) == 0))
                bfd_pic32_scan_data_section(s->sec, &total_data);

        total_data += 8; /* 2*4 bytes- zero terminated */

	DEBUG({
	    LOG("  null terminator, template += 1 pword\n");
            LOG("\n Total initialized data: %x pwords\n", total_data/4);
	  });

        /* allocate memory for the template */
        init_shared_data = (unsigned char *) bfd_alloc (link_info.output_bfd, total_data);
        if (!init_shared_data)
        {
            fprintf( stderr, "Link Error: not enough memory for data template\n");
            abort();
        }

        /* fill the template with a default value */
        init_shared_data = memset( init_shared_data, PAD_PATTERN, total_data);

        /* attach it to the input section */
        sec = bfd_get_section_by_name(init_shared_bfd, ".shared.dinit");
        if (sec)
        {
            sec->rawsize = total_data;
            sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE | SEC_KEEP);
            sec->contents = init_shared_data;
            bfd_set_section_size (init_shared_bfd, sec, total_data);
            init_shared_template = sec;  /* save a copy for later */
        }
        else
	  PIC32_DEBUG("after_open: section .shared.dinit not found");
    } /* if (pic32_data_init) */
    else
    {
        /* warn if initial data values will be ignored */
        for (s = shared_data_sections; s != NULL; s = s->next)
            if (s->sec)
                bfd_pic32_skip_data_section(s->sec, &total_data);
    }
}


/* lghica co-resident */
void pic32_create_rom_usage_template(void)
{
    int                     rom_usage_size= 0;
    asection                *sec;

