zeha/xc32/pic32c-source/binutils/ld/mchp/pic32m-emul.c
    rom_usage_bfd = bfd_pic32_create_rom_usage_bfd (link_info.output_bfd);
    bfd_pic32_add_bfd_to_link (rom_usage_bfd, rom_usage_bfd->filename);

    /* Compute size of flash usage template */

    LANG_FOR_EACH_INPUT_STATEMENT (f)
    {
        for (sec = f->the_bfd->sections;
                    sec != (asection *) NULL;
                    sec = sec->next)
            if ((sec->rawsize > 0)
                && ((sec->flags & SEC_EXCLUDE) == 0)
                && PIC32_IS_CODE_ATTR(sec))
            {
                if (strcmp(sec->name, ".dinit") == 0)
                    continue;
                else
                    rom_usage_size += 8;
            }
    }

    rom_usage_size += 8;    /* .text section in linker script */
    rom_usage_size += 16;   /* count for .rom_usage and .ram_usage */
    rom_usage_size += 4;    /* zero terminated */


    /* allocate memory for the template */
    rom_usage_data = (unsigned char *) bfd_alloc (link_info.output_bfd, rom_usage_size);

    if (!rom_usage_data)
    {
        fprintf( stderr, "Link Error: not enough memory for rom usage template\n");
        abort();
    }

    /* fill the template with a default value */
    rom_usage_data = memset( rom_usage_data, PAD_PATTERN, rom_usage_size);
    /* attach it to the input section */
    sec = bfd_get_section_by_name(rom_usage_bfd, ".rom_usage");

    if (sec)
    {
        sec->rawsize = rom_usage_size;
        sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE | SEC_KEEP);
        sec->contents = rom_usage_data;
        bfd_set_section_size (rom_usage_bfd, sec, rom_usage_size);
        rom_usage_template = sec;  /* save a copy for later */
    }
    else
      PIC32_DEBUG("after_open: section .rom_usage not found");

}


/* lghica co-resident */
void pic32_create_ram_usage_template(void)
{
    int                     ram_usage_size= 0;
    asection                *sec;

    ram_usage_bfd = bfd_pic32_create_ram_usage_bfd (link_info.output_bfd);
    bfd_pic32_add_bfd_to_link (ram_usage_bfd, ram_usage_bfd->filename);

    /* Compute size of flash usage template */

    LANG_FOR_EACH_INPUT_STATEMENT (f)
    {
        for (sec = f->the_bfd->sections;
                    sec != (asection *) NULL;
                    sec = sec->next)
            if ((sec->rawsize > 0) && ((sec->flags & SEC_EXCLUDE) == 0)
                    && (PIC32_SECTION_IN_DATA_MEMORY(sec) || PIC32_IS_MEMORY_ATTR(sec)))
                ram_usage_size += 8;
    }

    ram_usage_size += 4; /* zero terminated */


    /* allocate memory for the template */
    ram_usage_data = (unsigned char *) bfd_alloc (link_info.output_bfd, ram_usage_size);

    if (!ram_usage_data)
    {
        fprintf( stderr, "Link Error: not enough memory for ram usage template\n");
        abort();
    }

    /* fill the template with a default value */
    ram_usage_data = memset( ram_usage_data, PAD_PATTERN, ram_usage_size);

    /* attach it to the input section */
    sec = bfd_get_section_by_name(ram_usage_bfd, ".ram_usage");

    if (sec)
    {
        sec->rawsize = ram_usage_size;
        sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE | SEC_KEEP);
        sec->contents = ram_usage_data;
        bfd_set_section_size (ram_usage_bfd, sec, ram_usage_size);
        ram_usage_template = sec;  /* save a copy for later */
    }
    else
      PIC32_DEBUG("after_open: section .ram_usage not found");
}
